[
  {
    "file": "410_dentist.json",
    "question_id": 11,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 68-jarige patiënt met atriumfibrilleren gebruikt apixaban (Eliquis) 5mg 2x daags. Element 16 moet worden geëxtraheerd wegens uitgebreide cariës en pijn. INR is niet bepaald (niet van toepassing bij DOAC). Laatste cardiale controle 3 maanden geleden was goed. Cardiologische contra-indicatie voor stoppen anticoagulatie. Geplande extractie is relatief eenvoudig (mobiele kroon, goede toegankelijkheid).\nVRAAG: Wat is het meest veilige perioperatieve anticoagulatie management?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 24,
    "field": "explanation",
    "text": "Klinische presentatie (bilaterale spierpijn, beperkte opening, klikken, stressrelatie) wijst op myofasciaal pijnsyndroom. Eerste lijn behandeling: rust, warmte, zachte kost, stress management, fysiotherapie. MRI (A) is niet de eerste keuze zonder falen van conservatieve behandeling. RA (C) zou andere gewrichten betreffen. Discdislocatie zonder reductie (D) geeft andere symptomen. Splint (E) kan helpen maar is geen primaire behandeling."
  },
  {
    "file": "410_dentist.json",
    "question_id": 45,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 28-jarige patiënt klaagt over gevoeligheid en esthetische problemen door gingivale recessie element 23 (Miller Class I, 4mm recessie). Patiënt heeft orthodontische behandeling gehad. Goede mondhygiëne, geen actieve parodontitis. Adequate breedte van gekeratiniseerde gingiva lateraal van defect.\nVRAAG: Welke mucogingivale procedure geeft het beste esthetische en functionele resultaat?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 53,
    "field": "options",
    "index": 1,
    "text": "Conservatief management: zacht dieet, warmtetherapie, monitoring"
  },
  {
    "file": "410_dentist.json",
    "question_id": 53,
    "field": "correct_answer_text",
    "text": "Conservatief management: zacht dieet, warmtetherapie, monitoring"
  },
  {
    "file": "410_dentist.json",
    "question_id": 53,
    "field": "explanation",
    "text": "Milde TMJ-symptomen tijdens orthodontie zijn gebruikelijk en meestal tijdelijke adaptieve responsen. Conservatief management is de eerste lijn: zacht dieet, warmtetherapie, stressreductie, monitoring. De symptomen verdwijnen meestal binnen enkele weken. Het stoppen van de behandeling (A) is een onnodige onderbreking. MRI (C) is niet geïndiceerd bij milde symptomen. Occlusale aanpassing (D) is prematuur tijdens actieve behandeling. Verandering van behandeling (E) is niet gerechtvaardigd voor milde symptomen."
  },
  {
    "file": "410_dentist.json",
    "question_id": 64,
    "field": "explanation",
    "text": "Medicatie-geïnduceerde xerostomie vereist uitgebreid management omdat simpele interventies inadequaat zijn bij ernstige hyposalivatie. Een combinatiebenadering maximaliseert het voordeel: xylitol/cholinerge stimulanten voor de resterende functie, vervangers voor comfort, en hoge-dosis fluoride voor remineralisatie. Medicatiewijziging (A) is niet altijd mogelijk. Alleen vervangers (B) is inadequaat. Xylitol alleen (C) is onvoldoende bij ernstige xerostomie. Pilocarpine alleen (D) heeft een beperkte werkzaamheid bij medicatie-geïnduceerde xerostomie."
  },
  {
    "file": "410_dentist.json",
    "question_id": 68,
    "field": "explanation",
    "text": "Meerdere erosiefactoren vereisen een uitgebreide benadering: een op maat gemaakte gebitsbeschermer tegen chloorblootstelling, dieetadvisering voor energiedrankjes, en medisch management van GERD. Enkele interventies (A,B,D,E) adresseren niet alle veroorzakende factoren. Het succes van erosiepreventie vereist de eliminatie/reductie van alle zuurbronnen plus beschermende maatregelen. Een stuksgewijze benadering heeft een suboptimaal resultaat bij meerdere blootstellingen."
  },
  {
    "file": "410_dentist.json",
    "question_id": 72,
    "field": "options",
    "index": 1,
    "text": "Procedure uitleg + belangrijke complicaties + alternatieven + schriftelijke toestemming"
  },
  {
    "file": "410_dentist.json",
    "question_id": 72,
    "field": "correct_answer_text",
    "text": "Procedure uitleg + belangrijke complicaties + alternatieven + schriftelijke toestemming"
  },
  {
    "file": "410_dentist.json",
    "question_id": 72,
    "field": "explanation",
    "text": "WGBO Artikel 7:448 vereist informed consent met: (1) een uitleg van de procedure, (2) een verklaring van belangrijke risico's (ook <1% bij ernstige gevolgen), (3) het bespreken van alternatieven, (4) schriftelijke vastlegging bij complexe behandeling. Mondelinge toestemming (A) is inadequaat bij chirurgie. Een risicodrempel van 10% (C) is incorrect - ernstige gevolgen zoals zenuwletsel moeten altijd bekendgemaakt worden. Algemene formulieren (D) zijn onvoldoende - specifieke toestemming is nodig. Delegatie (E) is niet toegestaan - de tandarts moet persoonlijk informeren."
  },
  {
    "file": "410_dentist.json",
    "question_id": 75,
    "field": "options",
    "index": 4,
    "text": "De schooldirecteur kan toestemming geven voor student medical care"
  },
  {
    "file": "410_dentist.json",
    "question_id": 75,
    "field": "explanation",
    "text": "De Nederlandse wet (WGBO Artikel 7:450) staat de behandeling van minderjarigen <16 toe als zij \"wilsbekwaam\" zijn - in staat om de aard, gevolgen en alternatieven van de behandeling te begrijpen. Een 15-jarige die de procedure begrijpt en de gevolgen kan inschatten, wordt beschouwd als competent. Absolute ouderlijke toestemming (A) is incorrect voor wilsbekwame minderjarigen. Spoedeisende behandeling alleen (B) is te restrictief. Een 16+ automatische toestemming (C) is een incorrecte leeftijdsdrempel. De schooldirecteur (E) heeft geen legale basis voor toestemming."
  },
  {
    "file": "410_dentist.json",
    "question_id": 162,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 28-jarige patiënt wordt onwel tijdens wortelkanaalbehandeling: plotselinge kortademigheid, urticaria, angio-oedeem van lippen/tong, bloeddruk 80/40. Patiënt is bekend allergisch voor latex. Procedure werd uitgevoerd met latex handschoenen.\nVRAAG: Welke behandeling heeft de hoogste prioriteit bij deze anafylactische reactie?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 168,
    "field": "explanation",
    "text": "Pijn op de borst + dyspneu + risicofactoren = ACS totdat het tegendeel bewezen is. Stress van de tandheelkundige procedure kan een trigger zijn. Troponine kan initieel normaal zijn. Behandeling: zuurstof, aspirine 300mg (indien geen contra-indicatie), bel 112, monitoring. GEEN procedurele stress toevoegen - stabiliseren en transporteren."
  },
  {
    "file": "410_dentist.json",
    "question_id": 171,
    "field": "explanation",
    "text": "Recente MI patiënten (6 weken): infectierisico bij onbehandelde pulpitis hoger dan procedureel risico. Management: stressreductie (premedicatie, adequate anesthesie), korte afspraken, vitale functies monitoring, zuurstof beschikbaar. Endodontie veiliger dan extractie. Cardioloog raadplegen maar tandheelkundige noodsituatie adequaat behandelen."
  },
  {
    "file": "410_dentist.json",
    "question_id": 172,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 38-jarige patiënt met ulceratieve colitis gebruikt adalimumab (TNF-α remmer) + prednison 10mg dagelijks. Presenteert zich met acuut periapicaal abces element 47 met faciale zwelling. Immunosuppressie zorgt voor atypische infectie presentatie.\nVRAAG: Welke management strategie is het meest geschikt bij een immuungecompromitteerde patiënt?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 172,
    "field": "options",
    "index": 1,
    "text": "Systemische antibiotica vóór elke tandheelkundige procedure"
  },
  {
    "file": "410_dentist.json",
    "question_id": 172,
    "field": "options",
    "index": 2,
    "text": "Stop adalimumab 2 weken voor en na procedure"
  },
  {
    "file": "410_dentist.json",
    "question_id": 172,
    "field": "explanation",
    "text": "TNF-α remmers: ernstig immuungecompromitteerd, atypische infectie presentatie, slechte infectiecontrole. Agressief management nodig: breed-spectrum antibiotica (amoxicilline/clavulanaat of clindamycine), chirurgische drainage, nauwkeurige monitoring. Adalimumab stoppen wordt meestal niet aanbevolen voor tandheelkundige procedures - raadpleeg gastro-enteroloog."
  },
  {
    "file": "410_dentist.json",
    "question_id": 173,
    "field": "explanation",
    "text": "Levercirrose: multifactoriële coagulopathie - verminderde synthese stollingsfactoren (verlengde INR), trombocytopenie (hypersplenisme), mogelijke plaatjesdisfunctie. Child-Pugh B = significante hepatische disfunctie. Tandheelkundig management: INR <3.0 + plaatjes >50.000 meestal veilig voor kleine procedures met lokale hemostatische maatregelen."
  },
  {
    "file": "410_dentist.json",
    "question_id": 174,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 45-jarige vrouw met lupus erythematosus systemicus gebruikt hydroxychloroquine + prednison 15mg dagelijks. Ontwikkelt orale ulceratie, erythemateuze vlekken op hard palatum, en witte strepen op buccale mucosa. Geen pijn, wel branderig gevoel.\nVRAAG: Welke orale manifestatie van SLE vereist het meest urgente systemische management?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 175,
    "field": "options",
    "index": 2,
    "text": "Medicatie-gerelateerde osteonecrose (MRONJ) - conservatief management"
  },
  {
    "file": "410_dentist.json",
    "question_id": 175,
    "field": "correct_answer_text",
    "text": "Medicatie-gerelateerde osteonecrose (MRONJ) - conservatief management"
  },
  {
    "file": "410_dentist.json",
    "question_id": 175,
    "field": "explanation",
    "text": "MRONJ door zoledronaat (bisfosfonaat) + bortezomib: niet-genezende extractieplaatsen, botblootstelling, pijn. Conservatief management: debridement necrotisch weefsel, antibiotica bij infectie, pijncontrole. NIET stoppen oncologische medicatie - potentieel fataal. Preventie cruciaal: tandheelkundige goedkeuring vóór bisfosfonaattherapie."
  },
  {
    "file": "410_dentist.json",
    "question_id": 177,
    "field": "explanation",
    "text": "HBV post-exposure management: urgent anti-HBs bepalen van alle blootgestelde personen. Niet-immune (<10 IU/L): HBIG + versnelde vaccinatie. Immune (>100 IU/L): geen actie. GGD consultatie essentieel. Documenteer blootstellingsomstandigheden. Nederlands HBV post-exposure protocol volgen."
  },
  {
    "file": "410_dentist.json",
    "question_id": 178,
    "field": "options",
    "index": 4,
    "text": "Pulpotomie als tijdelijke procedure tot postpartum"
  },
  {
    "file": "410_dentist.json",
    "question_id": 180,
    "field": "options",
    "index": 1,
    "text": "INR verlagen naar 1.5-2.0 voor procedure"
  },
  {
    "file": "410_dentist.json",
    "question_id": 181,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 45-jarige patiënt gebruikt clopidogrel 75mg na recente PCI met drug-eluting stent (3 maanden geleden). Cardioloog benadrukt dat duale antiplaatjestherapie (aspirine + clopidogrel) absoluut noodzakelijk is voor minimaal 12 maanden wegens stent-trombose risico.\nVRAAG: Wat is de aanbevolen management bij noodzakelijke orale chirurgie?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 181,
    "field": "options",
    "index": 0,
    "text": "Clopidogrel stoppen 7 dagen voor procedure, aspirine continueren"
  },
  {
    "file": "410_dentist.json",
    "question_id": 182,
    "field": "explanation",
    "text": "Bij eGFR 30-60 ml/min: metformine stoppen na contrast-CT tot nierfunctie stabiel (48-72u). Modern bewijs toont dat stoppen vóór procedure niet nodig bij stabiele nierfunctie. Lactaatacidose risico laag bij normale nierfunctie pre-procedure. Nederlandse Radiologie richtlijnen 2021."
  },
  {
    "file": "410_dentist.json",
    "question_id": 185,
    "field": "explanation",
    "text": "Fenytoïne-hyperplasie is dosisafhankelijk en plaque-geïnduceerd. Management: chirurgische reductie + strikte plaque controle (3-maandelijkse recall). Zonder optimale mondhygiëne recidiveren hyperplasie. Sommige studies suggereren foliumzuurdeficiëntie rol, maar onderbouwing beperkt. Medicatieswitch eerste keuze indien mogelijk."
  },
  {
    "file": "410_dentist.json",
    "question_id": 186,
    "field": "options",
    "index": 2,
    "text": "Conservatief management: intensieve mondhygiëne + frequent vervolg"
  },
  {
    "file": "410_dentist.json",
    "question_id": 186,
    "field": "correct_answer_text",
    "text": "Conservatief management: intensieve mondhygiëne + frequent vervolg"
  },
  {
    "file": "410_dentist.json",
    "question_id": 186,
    "field": "explanation",
    "text": "Lithium-geïnduceerde hyperplasie tijdens zwangerschap: psychiatrische stabiliteit prioriteit. Conservatief management: zorgvuldige plaque controle, frequente vervolgcontroles, topische antimicrobiële middelen indien nodig. Vermijd medicatie wijzigingen zonder psychiatrische consultatie. Chirurgie uitstellen tot postpartum. Monitor voor infectie secundair aan hyperplastisch weefsel."
  },
  {
    "file": "410_dentist.json",
    "question_id": 188,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 45-jarige patiënt gebruikt escitalopram 20mg dagelijks voor depressie. Rapporteert droge mond, maar laatste maanden ook bruxisme en kaakklemmen, vooral 's nachts. Partner klaagt over knarsgeluiden. Significante tandslijtage zichtbaar.\nVRAAG: Welke SSRI-gerelateerde bijwerking vereist tandheelkundig management?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 188,
    "field": "explanation",
    "text": "SSRI-geïnduceerd bruxisme: veelvoorkomende bijwerking door serotonine onbalans. Significante tandslijtage, TMJ symptomen mogelijk. Management: occlusale splint, stressreductietechnieken. Psychiatrische consultatie over dosis aanpassing of overschakelen medicatie. Buspiron als aanvullende therapie soms effectief voor SSRI-geïnduceerde bewegingsbijwerkingen."
  },
  {
    "file": "410_dentist.json",
    "question_id": 192,
    "field": "explanation",
    "text": "HBV post-exposure management: urgent anti-HBs bepalen van alle blootgestelde personen. Niet-immune (<10 IU/L): HBIG + versnelde vaccinatie. Immune (>100 IU/L): geen actie. GGD consultatie essentieel. Documenteer blootstellingsomstandigheden. Nederlands HBV post-exposure protocol volgen."
  },
  {
    "file": "410_dentist.json",
    "question_id": 202,
    "field": "options",
    "index": 4,
    "text": "Pulpotomie als tijdelijke procedure tot postpartum"
  },
  {
    "file": "410_dentist.json",
    "question_id": 202,
    "field": "explanation",
    "text": "Irreversibele pulpitis vereist definitieve behandeling - uitstel riskeert cellulitis en sepsis. Lidocaïne zonder adrenaline is veilig in het 3e trimester. Bij pre-eclampsie: adrenaline vermijden (hypertensieve crisis). Korte afspraak, semi-rechtopstaande positie, bloeddruk monitoren. Consultatie met gynaecoloog tijdens de procedure."
  },
  {
    "file": "410_dentist.json",
    "question_id": 204,
    "field": "explanation",
    "text": "Terminale kankerzorg: comfort en kwaliteit van leven hebben prioriteit boven curatieve behandeling. Het management van mucositis omvat: pijnverlichting, zachte reiniging en infectiepreventie. Bij neutropenie/trombocytopenie: invasieve procedures vermijden. Multidisciplinaire palliatieve zorgteams moeten betrokken zijn. Respect voor de wensen van de patiënt en familie is essentieel."
  },
  {
    "file": "410_dentist.json",
    "question_id": 208,
    "field": "options",
    "index": 0,
    "text": "Premedicatie bronchodilatoren + continue thuis O2 tijdens procedure"
  },
  {
    "file": "410_dentist.json",
    "question_id": 208,
    "field": "options",
    "index": 2,
    "text": "Hoge-flow zuurstof (15L/min) tijdens procedure"
  },
  {
    "file": "410_dentist.json",
    "question_id": 208,
    "field": "correct_answer_text",
    "text": "Premedicatie bronchodilatoren + continue thuis O2 tijdens procedure"
  },
  {
    "file": "410_dentist.json",
    "question_id": 208,
    "field": "explanation",
    "text": "End-stage COPD: verstoring van gevestigde zuurstoftherapie vermijden. Continue basis O2, premedicatie met bronchodilatoren, semi-rechtopstaande positie, pulsoximetrie monitoring. Vermijd hoge-flow O2 (CO2 retentie risico). Algemene anesthesie is extreem hoog risico. BiPAP tijdens de procedure is onpraktisch. De procedure moet kort zijn, met adequate lokale anesthesie en stressminimalisatie."
  },
  {
    "file": "410_dentist.json",
    "question_id": 209,
    "field": "options",
    "index": 3,
    "text": "NPO 6 uur vóór procedure - lege maag"
  },
  {
    "file": "410_dentist.json",
    "question_id": 210,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 25-jarige patiënt met ernstige tandheelkundige fobie heeft paniekaanvallen bij tandartsafspraken. Eerdere pogingen: bewuste sedatie is mislukt, algemene anesthesie is te duur. De patiënt heeft urgente endodontische behoeften maar weigert alle behandeling. De pijn beïnvloedt werk/relaties.\nVRAAG: Welke fobie management strategie heeft de beste onderbouwing?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 215,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 35-jarige patiënt heeft klachten van kaak klikken, beperking van de mondopening (25mm maximum), pijn bij kauwen. TMJ MRI toont anterieure discusdislocatie zonder reductie (gesloten slot). Conservatieve therapie (splint, fysio) 3 maanden mislukt.\nVRAAG: Welke volgende stap in TMJ interne derangement management is geïndiceerd?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 239,
    "field": "explanation",
    "text": "Schizofrenie management: realistische verwachtingen, vereenvoudigde routines, ondersteuning van een zorgverlener, en frequent professioneel onderhoud. Tekorten in uitvoerende functies vereisen externe structuur. Prioriteer de preventie van acute problemen. Sociale ondersteuningssystemen zijn essentieel. Medicatiebijwerkingen (xerostomie) vereisen monitoring. De behandelbenadering moet gefaseerd zijn."
  },
  {
    "file": "410_dentist.json",
    "question_id": 253,
    "field": "explanation",
    "text": "Tacrolimus, zoals ciclosporine, veroorzaakt gingivale hyperplasie door de inhibitie van collagenase en verhoogde fibroblastproliferatie. De incidentie is lager dan bij ciclosporine (5-15% vs 25-30%). Management: optimale plaquecontrole, gingivectomie indien nodig. Een medicatieswitch kan worden overlegd met het transplantatieteam, maar immunosuppressie heeft prioriteit."
  },
  {
    "file": "410_dentist.json",
    "question_id": 254,
    "field": "explanation",
    "text": "Duloxetine (SNRI) heeft significante anticholinerge bijwerkingen, waaronder xerostomie. Pregabaline heeft een minimaal effect op de speekselproductie. Management: dosisreductie indien mogelijk, kunstmatig speeksel, xylitol, frequent water drinken, intensieve fluoridetherapie. Overleg met de psychiater over alternatieve pijnbeheersing."
  },
  {
    "file": "410_dentist.json",
    "question_id": 258,
    "field": "options",
    "index": 1,
    "text": "Graduated exposure therapy over meerdere bezoeken"
  },
  {
    "file": "410_dentist.json",
    "question_id": 261,
    "field": "options",
    "index": 1,
    "text": "Begrip van de procedure + risico's + alternatieven + consequenties"
  },
  {
    "file": "410_dentist.json",
    "question_id": 261,
    "field": "correct_answer_text",
    "text": "Begrip van de procedure + risico's + alternatieven + consequenties"
  },
  {
    "file": "410_dentist.json",
    "question_id": 264,
    "field": "explanation",
    "text": "Methylfenidaat + adrenaline kunnen synergetische cardiovasculaire effecten hebben: ernstige hypertensie, tachycardie, aritmieën. Bij een verhoogde bloeddruk aan de basis: overweeg lidocaïne zonder adrenaline of stel de procedure uit. Monitor de vitale functies nauwkeurig. Bestaande hypertensie verhoogt het risico. Houd noodprotocollen beschikbaar."
  },
  {
    "file": "410_dentist.json",
    "question_id": 281,
    "field": "text",
    "text": "KLINISCHE CASUS: Een 26-jarige patiënt heeft TMJ-pijn en -disfunctie na een verstandskiesextractie 2 maanden geleden. Beperkte opening 25mm, deflectie naar rechts tijdens opening. Rapporteert gevoelloosheid aan de linguale zijde van de tong rechts sinds de procedure. Geen verbetering met conservatieve therapie.\nVRAAG: Welke diagnostische evaluatie heeft prioriteit voor de beoordeling van de nervus lingualis?"
  },
  {
    "file": "410_dentist.json",
    "question_id": 307,
    "field": "options",
    "index": 4,
    "text": "Procedure 24 uur uitstellen voor medicatiewashtout"
  },
  {
    "file": "410_dentist.json",
    "question_id": 309,
    "field": "explanation",
    "text": "Kosteneffectieve COVID-19 preventie: risicogestratificeerde benadering op basis van het type procedure (aerosolgenererend versus niet-aerosolgenererend), patiëntrisicofactoren en gemeenschapstransmissiecijfers. Universeel N95 is duur en onnodig voor alle procedures. Verhoogde PBM voor hoogrisicosituaties, routinematige PBM voor standaardzorg."
  },
  {
    "file": "arts_irt.json",
    "question_id": 38,
    "field": "options",
    "index": 3,
    "text": "D. 'Wait and see' beleid."
  }
]