[
  {
    "title": "Definition of Dental Anatomy",
    "content": "Dental anatomy is the area of dental science that deals with the morphology of teeth, including their development, form, function, and identification. It considers individual teeth as well as their relationships to each other in the same arch and between the maxillary and mandibular arches. A solid understanding of dental anatomy is fundamental to the study of other dental disciplines. This includes occlusion, esthetics, phonetics, and functional aspects of oral health. It forms the basis for diagnosis, treatment planning, and successful dental restorations. Dental anatomy helps in differentiating various types of teeth and their roles in mastication, guidance, and appearance.",
    "reference": "See Fig. 1.1 on p. 1"
  },
  {
    "title": "Tooth Arches and Dentitions",
    "content": "Humans have two arches in the mouth: maxillary (upper) and mandibular (lower). Each arch contains teeth in two sets during the lifetime: the primary (deciduous) dentition and the permanent (succedaneous) dentition. The primary teeth begin forming in utero around the 14th week and typically begin erupting at about 6 months. By age 2–3, all 20 primary teeth are usually present. Permanent teeth begin to replace the primary teeth around age 6 and include up to 32 teeth. The full permanent dentition, excluding third molars, usually completes by ages 14–15, with third molars possibly erupting later."
  },
  {
    "title": "Tooth Numbering Systems",
    "content": "There are several notation systems used to identify teeth. The Universal Numbering System labels permanent teeth from 1 to 32 and primary teeth from A to T. Palmer Notation uses quadrant brackets and numbers/letters to show location, with 1–8 for permanent and A–E for primary teeth. The FDI (Federation Dentaire Internationale) system uses two digits: the first digit indicates the quadrant and the second digit indicates the tooth’s position in the quadrant. For example, '11' refers to the upper right central incisor. These systems are essential for dental records and communication among professionals."
  },
  {
    "title": "Tooth Formulas: Primary and Permanent",
    "content": "Dental formulas represent the number and types of teeth in each quadrant. For primary teeth: 2 incisors (I), 1 canine (C), and 2 molars (M), expressed as I 2/2, C 1/1, M 2/2 = 10 total. For permanent dentition, the formula includes premolars and an extra molar: I 2/2, C 1/1, P 2/2, M 3/3 = 16 per arch, or 32 total teeth. These formulas help in understanding dentition and identifying missing or extra teeth.",
    "reference": "See Fig. 1.2A–B on p. 4"
  },
  {
    "title": "Crown and Root Structure",
    "content": "Each tooth has two main parts: the crown and the root. The crown is the visible part and is covered by enamel. The root is embedded in the alveolar bone and is covered by cementum. Between them is the cemento-enamel junction (CEJ). Inside the tooth lies the pulp chamber and root canal, which house the dental pulp. This pulp is vital during development and provides nutrients and sensory feedback throughout life.",
    "reference": "See Fig. 1.3 and Fig. 1.4 on p. 6"
  },
  {
    "title": "Tooth Tissues",
    "content": "A tooth is made up of four tissues. Three are hard: enamel, dentin, and cementum. The fourth is soft: the pulp. Enamel is the hardest tissue in the human body and covers the crown. Dentin lies beneath enamel and forms the bulk of the tooth. Cementum covers the root and helps anchor the tooth in the socket. The pulp contains nerves, blood vessels, and connective tissue that sustain the tooth.",
    "reference": "See Fig. 1.4 on p. 6"
  },
  {
    "title": "Tooth Surfaces",
    "content": "Each tooth has five surfaces: mesial (toward the midline), distal (away from midline), facial (labial for anterior teeth or buccal for posterior teeth), lingual (facing the tongue), and occlusal or incisal (chewing or cutting surface). Proper naming of surfaces is crucial in describing cavities, restorations, and tooth orientation. It also aids in treatment planning and charting.",
    "reference": "See Fig. 1.8 on p. 7"
  },
  {
    "title": "Contact Areas Between Teeth",
    "content": "Teeth typically have contact areas where they touch their adjacent neighbors on the mesial and distal sides. These contacts help stabilize the arch and prevent food impaction. In central incisors, contact is mesial-to-mesial, which is unique. These areas shift slightly with age and wear."
  },
  {
    "title": "Tooth Morphology Features",
    "content": "Important morphological features include cusps (pointed projections), cingula (convex bulges on the lingual side of anterior teeth), fossae (shallow depressions), ridges (linear elevations), pits (small indentations), grooves (lines between cusps), lobes (developmental segments), and tubercles (small projections). Understanding these landmarks is essential for identifying teeth and performing restorative procedures.",
    "reference": "See Fig. 1.9–1.12 on p. 7–9"
  }
]