[
  {
    "title": "Overview of Maxillary Molars",
    "content": "Maxillary molars are the largest and strongest teeth in the upper arch. They are three-rooted (two buccal, one lingual), with crowns wider buccolingually than mesiodistally. They play a major role in mastication and are not succedaneous. First molars are considered the cornerstones of occlusion due to their location and function.",
    "reference": "See Fig. 11.1 and p. 156"
  },
  {
    "title": "Maxillary First Molar: Buccal Aspect",
    "content": "The buccal view reveals a trapezoidal crown with two major cusps—mesiobuccal and distobuccal. The mesiobuccal cusp is broader, while the distobuccal cusp is sharper. Three roots are visible: mesiobuccal, distobuccal, and lingual. The buccal groove separates the buccal cusps.",
    "reference": "See Fig. 11.4 and 11.8 on p. 157–158"
  },
  {
    "title": "Maxillary First Molar: Occlusal Features",
    "content": "The crown has four main cusps and often a fifth cusp (Cusp of Carabelli). The oblique ridge connects the distobuccal and mesiolingual cusps. Four fossae are present: central, distal, mesial triangular, and distal triangular. It displays the primary cusp triangle characteristic.",
    "reference": "See Fig. 11.1 and 11.11 on p. 156–158"
  },
  {
    "title": "Maxillary First Molar: Root Structure",
    "content": "It has three roots: two buccal (mesiobuccal and distobuccal) and one palatal (lingual), with the lingual root being the largest. The roots provide excellent anchorage and diverge widely, especially in well-developed molars.",
    "reference": "See Fig. 11.8 and 11.9 on p. 158"
  },
  {
    "title": "Maxillary Second Molar: Key Differences",
    "content": "The second molar is similar in form to the first but smaller and with less prominent features. The distolingual cusp is smaller, and in some cases may be absent. Roots tend to be closer together and may show partial fusion.",
    "reference": "See Fig. 11.19 and 11.20 on p. 166"
  },
  {
    "title": "Occlusal View of Second Molar",
    "content": "The crown outline may appear rhomboidal or heart-shaped depending on the presence of the distolingual cusp. More supplemental grooves may be present compared to the first molar.",
    "reference": "See Fig. 11.22 and 11.23 on p. 167"
  },
  {
    "title": "Maxillary Third Molar: Morphology",
    "content": "The third molar varies the most in shape and size. It may be smaller, with a heart-shaped occlusal outline. Often has three cusps—two buccal and one lingual—with a fused root system that curves distally. In many cases, the distolingual cusp is poorly developed or absent.",
    "reference": "See Fig. 11.28 through 11.36 on p. 169–170"
  },
  {
    "title": "Root Variations in Third Molars",
    "content": "Maxillary third molars often have fused roots forming a single tapered structure. Roots may be extremely short or unusually long and curved. This variation complicates extraction and endodontic procedures.",
    "reference": "See Fig. 11.34 and 11.36 on p. 170"
  },
  {
    "title": "Functional Role of Maxillary Molars",
    "content": "These molars assist mandibular molars in grinding and comminuting food. They support facial vertical height and contribute to the arch continuity and occlusal balance."
  },
  {
    "title": "Eruption and Development",
    "content": "First molars erupt around age 6, second molars between 12–13, and third molars between 17–21 years. First molars are the first permanent teeth to erupt and have no deciduous predecessors.",
    "reference": "See p. 156"
  },
  {
    "title": "The Cusp of Carabelli",
    "content": "A fifth cusp commonly found on the mesiolingual cusp of the maxillary first molar. It is considered a secondary cusp and may vary in size from a small tubercle to a prominent cusp.",
    "reference": "See Fig. 11.8 and Fig. 11.12 on p. 158"
  },
  {
    "title": "Primary Cusp Triangle",
    "content": "The maxillary molar cusp triangle is formed by the mesiobuccal, distobuccal, and mesiolingual cusps. This arrangement reflects their developmental origins and remains constant through molars.",
    "reference": "See Fig. 11.11 on p. 158"
  },
  {
    "title": "Clinical Significance of Oblique Ridge",
    "content": "The oblique ridge provides structural strength and resists occlusal forces. It may be crossed by developmental grooves, especially in worn specimens, linking major fossae.",
    "reference": "See Fig. 11.1 and p. 164"
  },
  {
    "title": "Anatomical Variations of Molars",
    "content": "Variations include missing distolingual cusps, extra cusps, fused roots, and unusual crown contours. Such differences are most common in third molars and can affect treatment planning.",
    "reference": "See Fig. 11.18 and 11.36 on p. 159–170"
  },
  {
    "title": "Summary: First vs. Second vs. Third Molar",
    "content": "First molars are largest and most complex with well-separated roots and five cusps. Second molars are smaller, with reduced distolingual cusps. Third molars are the most variable, often with fused roots and heart-shaped crowns."
  }
]