[
  {
    "title": "Pulp Cavity Structure",
    "content": "The pulp cavity is divided into two parts: the pulp chamber (in the crown) and the root canal (in the root). Odontoblasts in the coronal pulp are cuboidal but become flatter toward the root apex. This internal structure plays a critical role in tooth vitality and sensitivity.",
    "reference": "See Fig. 13.1 on p. 192"
  },
  {
    "title": "Pulp Horns and Their Significance",
    "content": "Pulp horns are projections of the pulp chamber corresponding to the cusps or lobes of the crown. They are more prominent in younger individuals and tend to regress with age due to secondary dentin formation.",
    "reference": "See Fig. 13.7 and Fig. 13.8B on p. 193"
  },
  {
    "title": "Size of Pulp Cavity and Age",
    "content": "In young individuals, the pulp cavity is large due to minimal dentin deposition. Over time, secondary dentin reduces the pulp chamber size, affecting restorative decisions.",
    "reference": "See Fig. 13.3A and B on p. 192"
  },
  {
    "title": "Apical Foramen and Development",
    "content": "Initially wide during development, the apical foramen becomes constricted upon root formation. Its position may vary, impacting endodontic procedures.",
    "reference": "See Fig. 13.4 on p. 192"
  },
  {
    "title": "Accessory and Delta Canals",
    "content": "Some teeth may have lateral or accessory canals branching from the main root canal. A delta system refers to multiple tiny canals near the apex, complicating endodontic cleaning.",
    "reference": "See Fig. 13.5 and Fig. 13.6 on p. 194"
  },
  {
    "title": "Root Canal Curvatures and Variations",
    "content": "Canal curvature varies from straight to sharply curved, particularly in mesial roots. Some canals join before exiting at a common apical foramen, while others remain separate.",
    "reference": "See Fig. 13.22 on p. 210"
  },
  {
    "title": "Radiographic Evaluation",
    "content": "Radiographs provide a two-dimensional view of three-dimensional pulp structures. Knowledge of internal anatomy helps interpret radiographs and identify accessory canals.",
    "reference": "See Fig. 13.2 on p. 192"
  },
  {
    "title": "Clinical Implications in Endodontics",
    "content": "Accurate knowledge of pulp anatomy prevents procedural errors like perforations or missed canals. Variation in anatomy due to age, trauma, or race must be considered during treatment."
  },
  {
    "title": "Tooth Fractures and Pulp Involvement",
    "content": "Fractures may involve the enamel, dentin, and pulp. Cusp fractures often follow developmental grooves and can lead to pulpitis.",
    "reference": "See Fig. 13.26 and Fig. 13.27 on p. 214"
  },
  {
    "title": "Mandibular Canal and Root Apex Relations",
    "content": "Understanding the proximity of mandibular root apices to the mandibular canal is essential in endodontics and surgery. Improper techniques may injure the mandibular nerve."
  }
]