[
  {
    "title": "Esthetic Tooth Proportions",
    "content": "The golden proportion principle guides the visual arrangement of anterior teeth. Ideal esthetics often position lateral incisal edges slightly apical to centrals and cuspids. Perceptions of personality can be affected by embrasure shapes—square shapes perceived as athletic, round as quiet.",
    "reference": "See Fig. 17.1 and 17.2 on p. 290"
  },
  {
    "title": "Variant Anatomy and Periodontal Implications",
    "content": "Anatomic variations like enamel pearls, tooth twinning, and dens in dente can complicate periodontal care. Such features may disrupt gingival attachment or alter root shape, requiring specialized hygiene tools and techniques.",
    "reference": "See Fig. 17.24 and 17.25A–B on p. 294"
  },
  {
    "title": "Tooth Position Variations and Their Effects",
    "content": "Tipped, rotated, or migrated teeth may alter occlusion, food clearance, and caries risk. These changes can also impact tooth eruption, alveolar bone health, and periodontal stability.",
    "reference": "See p. 294"
  },
  {
    "title": "Challenges in Crown Preparations",
    "content": "Crown preparations on tipped teeth increase the risk of pulp exposure due to less dentin thickness. Accurate preparation requires knowledge of underlying anatomy and pulp location.",
    "reference": "See p. 294"
  },
  {
    "title": "Interproximal Space and Caries Risk",
    "content": "Diastemas may reduce caries risk by enhancing plaque removal. In contrast, narrow or rotated teeth may hinder hygiene and elevate caries susceptibility.",
    "reference": "See p. 294"
  },
  {
    "title": "Impacted Teeth and Occlusal Effects",
    "content": "Impacted third molars and supernumerary teeth alter alveolar width and may cause occlusal disharmony. Microdontia can have the opposite effect, reducing the arch dimensions.",
    "reference": "See p. 294"
  },
  {
    "title": "Arch Form and Function",
    "content": "Tooth position affects arch classification, occlusion type, and presence of occlusal interferences. Canine-protected occlusion vs. group function plays a role in long-term stability.",
    "reference": "See p. 294"
  },
  {
    "title": "Forces and Their Impact",
    "content": "Increased occlusal forces from bruxism or prosthetic stress can cause tooth mobility, migration, or fremitus. Restorative planning must address load distribution and anatomy preservation.",
    "reference": "See p. 294–295"
  },
  {
    "title": "Sensitivity and Anatomical Variation",
    "content": "Tooth shape alterations due to erosion, abrasion, or abfraction lead to sensitivity and caries risk. Understanding the cause is crucial for targeted treatment and prevention.",
    "reference": "See p. 290–291"
  },
  {
    "title": "Functional Occlusion and Esthetics",
    "content": "Restorative treatment must maintain not only esthetics but also proper occlusal function. Anterior guidance, cusp placement, and embrasure form are all critical design elements.",
    "reference": "See Fig. 17.3 and 17.6 on p. 291"
  }
]