[
  {
    "title": "Overview of Mandibular Molars",
    "content": "Mandibular molars are the largest and strongest teeth in the lower jaw. They are key for mastication and comminution of food. Each mandibular molar typically has two roots—one mesial and one distal—and a crown wider mesiodistally than buccolingually. Mandibular molars erupt behind primary second molars and are not succedaneous.",
    "reference": "See Fig. 12.1 and p. 172"
  },
  {
    "title": "Mandibular First Molar: Occlusal View",
    "content": "The mandibular first molar usually has five cusps: mesiobuccal, distobuccal, distal, mesiolingual, and distolingual. Its occlusal outline is pentagonal. It features three pits: mesial, central, and distal, and prominent buccal and lingual grooves. The mesiobuccal groove may extend onto the buccal surface.",
    "reference": "See Fig. 12.1 and 12.2 on p. 173"
  },
  {
    "title": "Mandibular First Molar: Buccal Aspect",
    "content": "The buccal surface has two grooves: mesiobuccal and distobuccal, separating three cusps. Roots are broad buccolingually and widely separated at the apices. The crown tapers slightly toward the cervix, giving it a strong appearance.",
    "reference": "See Fig. 12.3 and 12.4 on p. 173"
  },
  {
    "title": "Lingual and Proximal Views of First Molar",
    "content": "The lingual cusps are sharper and taller than buccal ones. From the mesial view, both mesiolingual and mesiobuccal cusps are visible. Mesial root fluting provides strong anchorage; the distal root is rounder.",
    "reference": "See Fig. 12.5 and 12.6 on p. 173–174"
  },
  {
    "title": "Mandibular Second Molar: Occlusal Features",
    "content": "The second molar typically has four cusps: two buccal and two lingual. The occlusal pattern forms a cross with central pit and grooves extending at right angles. The crown is more symmetrical and rectangular compared to the first molar.",
    "reference": "See Fig. 12.22 and Fig. 12.25 on p. 183–184"
  },
  {
    "title": "Mandibular Second Molar: Buccal and Mesial Views",
    "content": "The buccal aspect shows less cusp prominence and only one buccal groove. From the mesial view, the roots are closer together than in the first molar and may show curvature. Cervical prominence is often more pronounced on the mesiobuccal lobe.",
    "reference": "See Fig. 12.23 and 12.24 on p. 183"
  },
  {
    "title": "Mandibular Third Molar: General Characteristics",
    "content": "The mandibular third molar is the most variable in size and shape. It often resembles the second molar but may have fused roots or malformed cusps. Its occlusal pattern is similar to second molars but more irregular.",
    "reference": "See Fig. 12.27–12.36 on p. 186–188"
  },
  {
    "title": "Root Morphology of Mandibular Molars",
    "content": "Mandibular molars have two roots: mesial and distal. The mesial root is broader and fluted, providing greater anchorage. Root fusion may occur in second and third molars.",
    "reference": "See Fig. 12.3 and 12.28 on p. 173, 186"
  },
  {
    "title": "Fissure Patterns and Cusp Naming",
    "content": "Occlusal patterns in mandibular molars vary: 'Y' shape is typical for first molars with five cusps. '+' pattern is common in second molars. Cusps include protoconid, metaconid, hypoconid, entoconid, and hypoconulid.",
    "reference": "See Fig. 12.27 on p. 186"
  },
  {
    "title": "Variations and Clinical Implications",
    "content": "Third molars often show impaction, unusual root form, or eruption failure. Partial eruption may cause periodontal issues or resorption of adjacent roots. Morphologic variations require careful planning in extractions and restorations.",
    "reference": "See Fig. 12.28 and 12.33 on p. 186–187"
  }
]