[
  {
    "title": "Maxillary Central Incisors: General Overview",
    "content": "The maxillary central incisors are the widest anterior teeth mesiodistally and are located on either side of the maxillary midline. They possess sharp mesioincisal angles and straight incisal edges. These teeth are critical for esthetics, phonetics, and incising food. Their crowns are symmetrical, and their roots are conical and straight.",
    "reference": "See Fig. 6.9 on p. 95"
  },
  {
    "title": "Labial Aspect of Central Incisors",
    "content": "The labial face of the central incisor is slightly convex, particularly at the cervical third. The incisal edge is straight, and developmental grooves may divide the surface into three lobes. Mamelons are often present in newly erupted teeth. The mesial outline is straighter than the distal, which is more curved.",
    "reference": "See Fig. 6.9 on p. 95"
  },
  {
    "title": "Lingual Surface and Shovel-Shape Trait",
    "content": "The lingual surface features a cingulum, marginal ridges, and a moderately deep lingual fossa. In some populations, a pronounced form called 'shovel-shaped incisor' appears, with exaggerated ridges and fossa. This variation is common in Mongoloid populations and may have clinical implications.",
    "reference": "See Fig. 6.3 on p. 93"
  },
  {
    "title": "Root Morphology of Central Incisors",
    "content": "The root of the maxillary central incisor is conical and straight, with a blunt apex. It tends to be rounded in cross-section and tapers lingually. Root curvature or unusual dimensions are rare but may affect endodontic procedures.",
    "reference": "See Fig. 6.12 on p. 96"
  },
  {
    "title": "Maxillary Lateral Incisors: Overview",
    "content": "Maxillary lateral incisors resemble central incisors but are smaller in all dimensions except root length. They are more variable in form and commonly exhibit anomalies such as peg shape or complete absence. These teeth are essential for esthetics and lateral guidance.",
    "reference": "See Fig. 6.19 on p. 100"
  },
  {
    "title": "Labial and Lingual Aspects of Lateral Incisors",
    "content": "The labial surface of lateral incisors is more curved than centrals, with rounded incisal angles. Lingually, they show more prominent cingula and deeper fossae. Variations like palatoradicular grooves may predispose to localized periodontal disease.",
    "reference": "See Fig. 6.14 and 6.21 on pp. 98, 101"
  },
  {
    "title": "Common Variations in Lateral Incisors",
    "content": "Lateral incisors are the second most variable teeth after third molars. Common anomalies include peg-shaped crowns, twisted roots, and exaggerated cingula. These differences may complicate orthodontic and prosthetic treatment.",
    "reference": "See Fig. 6.21 on p. 101"
  },
  {
    "title": "Incisal View and Crown Proportions",
    "content": "From the incisal view, maxillary central incisors appear triangular, while lateral incisors are more rounded. The labiolingual dimension is about two-thirds of the mesiodistal width in centrals. The cingulum is slightly offset to the distal, affecting the crown symmetry.",
    "reference": "See Fig. 6.11 on p. 95"
  },
  {
    "title": "Cervical Line Curvature",
    "content": "The mesial cervical line of maxillary incisors curves more incisally than the distal. This curvature helps distinguish between right and left teeth and influences crown contour and gingival architecture.",
    "reference": "See Fig. 6.10 on p. 95"
  },
  {
    "title": "Clinical Considerations: Esthetics and Restorations",
    "content": "Maxillary incisors are prominent in the smile zone, so shape, contour, and symmetry are crucial in restorative dentistry. Deviations such as peg laterals or asymmetric contacts can affect esthetics and function, requiring precise correction."
  }
]