[
  {
    "title": "Purpose of Tooth Trait Identification",
    "content": "Understanding tooth traits helps in identifying each tooth based on morphology. Key traits are categorized as set traits (deciduous vs. permanent), arch traits (maxillary vs. mandibular), class traits (incisors, canines, etc.), and type traits (e.g., central vs. lateral incisor)."
  },
  {
    "title": "Set Traits: Deciduous vs. Permanent",
    "content": "Permanent teeth are usually larger, have fewer cervical constrictions, and exhibit more wear. Primary teeth are whiter, have thinner enamel and dentin, and larger pulp chambers in proportion to crown size."
  },
  {
    "title": "Arch Traits: Maxillary vs. Mandibular",
    "content": "Maxillary anterior teeth are generally larger mesiodistally, with more prominent cingula. Mandibular teeth have flatter lingual surfaces and smaller dimensions."
  },
  {
    "title": "Class Traits: Incisors",
    "content": "Incisors are used for cutting. They have sharp incisal edges, prominent marginal ridges, and a single root. Mandibular incisors are smaller and narrower than maxillary ones."
  },
  {
    "title": "Class Traits: Canines",
    "content": "Canines are the longest teeth with pointed cusps, thick roots, and a prominent cingulum. They are crucial for guidance during lateral mandibular movements."
  },
  {
    "title": "Class Traits: Premolars",
    "content": "Premolars are transitional teeth with two cusps (or three in mandibular second premolars). They have at least one root, with maxillary first premolars sometimes exhibiting bifurcated roots."
  },
  {
    "title": "Class Traits: Molars",
    "content": "Molars have multiple cusps and roots. Maxillary molars often have three roots, mandibular molars two. First molars are the largest and most complex in form; third molars are often irregular and variable."
  },
  {
    "title": "Type Traits: Maxillary Central vs. Lateral Incisors",
    "content": "Maxillary central incisors are broader and more symmetrical. Lateral incisors have more rounded edges, pronounced marginal ridges, and deeper fossae."
  },
  {
    "title": "Type Traits: Mandibular Central vs. Lateral Incisors",
    "content": "Mandibular central incisors are the smallest and most symmetrical. Lateral incisors are slightly larger and display a distolingual twist."
  },
  {
    "title": "Trait Recognition in Practice",
    "content": "Tooth identification involves comparing shape, curvature, root form, and incisal or occlusal features. This is essential in clinical, forensic, and anthropological contexts."
  }
]