[
  {
    "title": "Temporomandibular Joint (TMJ) Anatomy",
    "content": "The temporomandibular joint (TMJ) is a bilateral synovial joint that connects the mandible to the temporal bone of the skull. It is composed of the mandibular condyle, the articular disc, and the glenoid fossa of the temporal bone. A fibrous capsule surrounds the joint, and several ligaments provide additional support. The TMJ allows both rotational and translational movements, enabling complex jaw functions such as chewing, speaking, and yawning."
  },
  {
    "title": "Articular Disc and Joint Compartments",
    "content": "The TMJ contains an articular disc made of dense fibrous connective tissue that divides the joint into upper and lower compartments. The upper compartment allows translational movements, while the lower compartment allows rotational (hinge) movement. The disc is biconcave in shape and functions to absorb shock and facilitate smooth movement. Its attachments to the condyle and surrounding structures help stabilize the joint during motion."
  },
  {
    "title": "Masseter Muscle",
    "content": "The masseter is a powerful muscle of mastication located on the lateral surface of the mandible. It originates from the zygomatic arch and inserts on the lateral surface of the mandibular ramus and angle. Its primary function is to elevate the mandible, enabling biting and chewing. The masseter works in coordination with other muscles to stabilize the jaw during function."
  },
  {
    "title": "Temporalis Muscle",
    "content": "The temporalis muscle is a fan-shaped muscle that originates from the temporal fossa and inserts onto the coronoid process of the mandible. It is responsible for elevating and retracting the mandible. The posterior fibers assist in retrusion, while the anterior fibers elevate the mandible. This muscle plays a critical role in closing the mouth and maintaining resting tone."
  },
  {
    "title": "Medial and Lateral Pterygoid Muscles",
    "content": "The medial pterygoid muscle assists in elevating the mandible and contributes to protrusive and lateral movements. It originates from the medial surface of the lateral pterygoid plate and inserts on the medial surface of the mandibular angle. The lateral pterygoid has two heads (superior and inferior) and inserts on the neck of the condyle and the articular disc. It is responsible for opening the mouth, protruding the mandible, and enabling lateral movements during chewing."
  },
  {
    "title": "Mandibular Movements: Rotation and Translation",
    "content": "Mandibular movement begins with rotation in the lower joint compartment, followed by translation in the upper compartment. During opening, the condyles rotate first and then slide forward along the articular eminence. This combined movement enables the mouth to open wide and close smoothly. Both types of motion are essential for mastication and speech."
  },
  {
    "title": "Protrusion and Retrusion of the Mandible",
    "content": "Protrusion is the forward movement of the mandible, primarily facilitated by the bilateral contraction of the lateral pterygoid muscles. Retrusion moves the mandible backward and involves the posterior fibers of the temporalis and digastric muscles. These movements help with incising food and restoring the jaw to a rest position after forward excursion."
  },
  {
    "title": "Lateral Excursions of the Mandible",
    "content": "Lateral movements of the mandible occur when the jaw shifts to the right or left. These are produced by coordinated contraction of contralateral lateral pterygoid muscles and ipsilateral temporalis. Lateral excursions are important during mastication, allowing grinding and shearing of food between molars. These movements also reveal the health and symmetry of the TMJ and muscle balance."
  },
  {
    "title": "Stages of Mastication",
    "content": "Mastication includes several stages: food selection and placement, incision, grinding, and bolus formation. It is a neuromuscular process involving teeth, joints, muscles, and sensory feedback. Efficient mastication depends on coordinated activity among the muscles of mastication and proper occlusal relationships."
  },
  {
    "title": "Sensory Feedback in Mastication",
    "content": "Mechanoreceptors in the periodontal ligament, muscles, and TMJ provide sensory feedback during chewing. These signals are processed in the brainstem and help modulate muscle activity, protect against overload, and adapt force depending on food consistency. This sensory system is essential for precise and efficient mastication."
  },
  {
    "title": "Temporomandibular Disorders (TMD)",
    "content": "Temporomandibular disorders (TMD) encompass a variety of conditions affecting the TMJ, masticatory muscles, and surrounding structures. Common symptoms include jaw pain, clicking or popping sounds, restricted movement, and headaches. Etiology is multifactorial, including trauma, occlusal interference, parafunction, and psychological stress."
  },
  {
    "title": "Bruxism and Muscle Overuse",
    "content": "Bruxism is the parafunctional habit of grinding or clenching teeth, often during sleep. It places excessive stress on the TMJ and muscles, leading to pain, tooth wear, fractures, and joint dysfunction. Management includes splint therapy, stress reduction, and behavioral intervention."
  },
  {
    "title": "TMJ Dysfunction and Joint Sounds",
    "content": "Joint sounds such as clicking or crepitus often indicate internal derangements of the TMJ, such as disc displacement. Clicking usually occurs when the disc slips out of position and then relocates during opening or closing. Persistent joint noises may warrant clinical and imaging evaluation to assess for underlying pathology."
  },
  {
    "title": "Management of TMD",
    "content": "Management of temporomandibular disorders may include reversible methods such as occlusal splints, physical therapy, medication, and behavioral counseling. In rare cases, surgical intervention may be necessary. Treatment is often multidisciplinary and focuses on relieving symptoms and restoring function."
  },
  {
    "title": "Functional Relationships in Mastication",
    "content": "The TMJ, teeth, muscles, and neurological input all function together to produce smooth, coordinated mastication. Any dysfunction in one component can affect the entire system. Understanding this relationship helps diagnose and treat conditions affecting the masticatory system holistically."
  }
]