[
  {
    "title": "Definition and Overview of Occlusion",
    "content": "Occlusion refers to the contact relationship between maxillary and mandibular teeth. Proper occlusion involves alignment, angulation, and articulation. It is influenced by heredity, dental development, and oral habits, and is fundamental to mastication and speech.",
    "reference": "See Fig. 14.1 on p. 220"
  },
  {
    "title": "Factors Influencing Occlusion",
    "content": "Occlusion is shaped by tooth eruption patterns, jaw growth, muscle function, and environmental influences. These factors interact during the mixed dentition phase, affecting final alignment and occlusal stability.",
    "reference": "See p. 220–221"
  },
  {
    "title": "Interarch Relationships",
    "content": "Interarch relationships involve the coordination of opposing teeth, particularly the molars and canines. These relationships determine overbite, overjet, and canine guidance. Normal occlusion requires proper intercuspation and alignment across the dental arches.",
    "reference": "See Fig. 14.3 on p. 222"
  },
  {
    "title": "Developmental Stages of Occlusion",
    "content": "Occlusion develops through three stages: primary (deciduous), mixed (transitional), and permanent. Each stage has distinct occlusal characteristics. Intercuspal relationships evolve with the eruption of permanent teeth.",
    "reference": "See Fig. 14.2 on p. 221"
  },
  {
    "title": "Terminal Plane Relationships",
    "content": "The terminal plane relationship refers to the distal surfaces of the second primary molars. Three types exist: flush terminal plane, mesial step, and distal step. These influence the first permanent molars’ final occlusion.",
    "reference": "See Fig. 14.5 on p. 224"
  },
  {
    "title": "Leeway Space",
    "content": "Leeway space is the difference in mesiodistal width between primary molars and permanent premolars. It allows the mesial migration of permanent molars, helping establish Class I occlusion.",
    "reference": "See Fig. 14.8 on p. 226"
  },
  {
    "title": "Molar Relationship Classification",
    "content": "Angle’s classification system defines molar relationships into Class I, Class II (divisions 1 and 2), and Class III. These classes are based on the position of the first molars and are used in orthodontic diagnosis.",
    "reference": "See Fig. 14.9 on p. 227"
  },
  {
    "title": "Canine Guidance",
    "content": "In ideal occlusion, canines guide the mandible during lateral movements, protecting posterior teeth from stress. This canine guidance is preferred over group function for longevity of the dentition.",
    "reference": "See Fig. 14.10 on p. 228"
  },
  {
    "title": "Ideal Occlusal Curves",
    "content": "The Curve of Spee (anteroposterior) and Curve of Wilson (mediolateral) help ensure proper occlusal function. They balance occlusal forces and improve mastication efficiency.",
    "reference": "See Fig. 14.13 on p. 230"
  },
  {
    "title": "Malocclusion",
    "content": "Malocclusion refers to deviations from ideal occlusion and includes crowding, spacing, rotations, and skeletal discrepancies. It may result from genetics, habits, or trauma and often requires orthodontic intervention.",
    "reference": "See Fig. 14.14 on p. 231"
  }
]