[
  {
    "title": "Tooth Traits: Class, Arch, and Type",
    "content": "Tooth traits are grouped into three categories: class traits (e.g., incisors, canines), arch traits (maxillary vs mandibular), and type traits (e.g., central vs lateral incisor). Class traits apply across both arches, arch traits distinguish upper from lower, and type traits identify specific teeth within a class and arch. Understanding these is key for tooth identification and dental charting.",
    "reference": "See p. 190"
  },
  {
    "title": "Class Traits: Incisors, Canines, Premolars, Molars",
    "content": "Class traits define general functions and shapes: incisors are for cutting, canines for tearing, premolars for tearing and grinding, and molars for grinding. Each has characteristic crown shapes and cusp patterns, contributing to their specific role in mastication.",
    "reference": "See Fig. 15.2 and p. 191"
  },
  {
    "title": "Arch Traits: Maxillary vs Mandibular",
    "content": "Maxillary teeth are generally wider buccolingually and have more prominent lingual anatomy, such as cingula and fossae. Mandibular teeth are narrower buccolingually, show more symmetrical crowns, and roots often tilt distally.",
    "reference": "See Fig. 15.3 and 15.4 on p. 192"
  },
  {
    "title": "Type Traits: Example in Incisors",
    "content": "Central incisors tend to be larger than lateral incisors. In maxillary arch, centrals are wider mesiodistally with straight incisal edges. Lateral incisors often show more curvature and less symmetry. Mandibular counterparts are generally narrower and show minimal features.",
    "reference": "See Table 1 on p. 313"
  },
  {
    "title": "Key Type Traits: Premolars",
    "content": "Maxillary first premolars have two roots and prominent mesial developmental grooves. Mandibular second premolars may have two or three cusps. Second premolars generally have more developed occlusal tables than first premolars.",
    "reference": "See Table 6 and Table 7 on p. 316–317"
  },
  {
    "title": "Key Type Traits: Molars",
    "content": "First molars are largest and have more prominent cusps. Maxillary first molars have the cusp of Carabelli, while mandibular first molars have five cusps. Third molars are highly variable, often smaller, and may have fused roots.",
    "reference": "See Table 8 and 9 on p. 318–319"
  },
  {
    "title": "Proximal Contacts and Heights of Contour",
    "content": "Proximal contact areas are generally more incisal or occlusal mesially, and more cervical distally. Heights of contour are in the cervical third facially and middle third lingually, especially for posterior teeth.",
    "reference": "See Figs. 5.7 and 5.27 on p. 82 and p. 95"
  },
  {
    "title": "Cervical Line (CEJ) Curvature",
    "content": "CEJ curvature is more pronounced on mesial surfaces than on distal surfaces. This curvature aids in identifying mesial vs distal aspects of a tooth.",
    "reference": "See Table 6.1 through 12.3 and Fig. 5.27 on p. 95"
  },
  {
    "title": "Lobes and Developmental Grooves",
    "content": "Each tooth is formed from developmental lobes. Most anterior teeth have four lobes—three labial and one lingual. Premolars have four or five lobes depending on the number of cusps. Molars typically develop from four or five lobes, each forming a cusp.",
    "reference": "See Fig. 4.12 and related tables on p. 67, 190"
  },
  {
    "title": "Tooth Identification Techniques",
    "content": "Teeth are identified by combining class, arch, and type traits, as well as using key features like cusp size, number, root shape, groove patterns, and CEJ curvature. Careful observation of these features allows for reliable identification of any permanent tooth."
  }
]