[
  {
    "title": "Overview of Permanent Canines",
    "content": "Permanent canines are located at the corners of the dental arches and are known as the 'cornerstones' of the mouth. They are the longest teeth in the mouth, offering strong anchorage due to their long, thick roots. Canines have a single pointed cusp and a labiolingually thick crown that resists wear and supports facial structure. Their location and form contribute to facial aesthetics and occlusal guidance."
  },
  {
    "title": "Functions and Significance of Canines",
    "content": "Canines guide teeth into occlusion and help disclude posterior teeth during lateral movements. Their robust structure enables them to withstand the forces of mastication. Due to their stability and longevity, they are often used in prosthodontic treatments. Canines maintain the vertical dimension of occlusion and help preserve the natural appearance of the face."
  },
  {
    "title": "Maxillary Canine: Labial View",
    "content": "From the labial aspect, the maxillary canine crown is convex with a prominent labial ridge. The mesial cusp ridge is shorter than the distal cusp ridge. Developmental depressions are visible mesially and distally. The cusp tip is typically aligned with the center of the root.",
    "reference": "See Fig. 8.2 and Fig. 8.9 on p. 118–119"
  },
  {
    "title": "Maxillary Canine: Lingual Features",
    "content": "The lingual surface of the maxillary canine displays a prominent cingulum, well-defined marginal ridges, and a lingual ridge. Two fossae flank the lingual ridge: the mesiolingual and distolingual fossae. The cervical line curves evenly from the lingual aspect.",
    "reference": "See Fig. 8.1 and Fig. 8.3 on p. 116"
  },
  {
    "title": "Maxillary Canine: Root Anatomy",
    "content": "The root is typically the longest in the maxillary arch, with deep mesial and distal developmental depressions. It is thick labiolingually and offers strong anchorage. Root curvature at the apical third is common, usually in a distal direction.",
    "reference": "See Fig. 8.12 on p. 120"
  },
  {
    "title": "Mandibular Canine: Labial Characteristics",
    "content": "Mandibular canines have longer crowns but narrower mesiodistal widths compared to maxillary canines. The labial surface is smooth, and the mesial outline is nearly straight and continuous with the root. Cusp tip is usually in line with the root axis or slightly lingual.",
    "reference": "See Fig. 8.14 on p. 123"
  },
  {
    "title": "Mandibular Canine: Lingual Anatomy",
    "content": "The lingual surface is less prominent than that of the maxillary canine. Cingulum and marginal ridges are smooth and shallow. The lingual ridge and fossae are minimal or absent.",
    "reference": "See Fig. 8.15 and Fig. 8.13 on p. 122–123"
  },
  {
    "title": "Root Anatomy of Mandibular Canines",
    "content": "Mandibular canine roots are slightly shorter and may exhibit bifurcation—labial and lingual roots—in some cases. They are slender and pointed, with a frequent mesial developmental depression.",
    "reference": "See Fig. 8.24 on p. 127"
  },
  {
    "title": "Incisal View Comparison",
    "content": "From the incisal view, maxillary canines appear more robust and symmetrical. Mandibular canines are narrower mesiodistally and show a more pointed cusp. Maxillary cusp ridges align more evenly, while mandibular cusps are slightly twisted and lingually inclined.",
    "reference": "See Fig. 8.6 and Fig. 8.23 on p. 126"
  },
  {
    "title": "Canine Eminence and Esthetics",
    "content": "The canine eminence is a prominent bony ridge overlying the root of the maxillary canine. It contributes significantly to the appearance and contour of the face, especially in the lip commissure region. Loss of canines can lead to facial collapse and aging effects."
  },
  {
    "title": "Eruption and Development of Canines",
    "content": "Maxillary canines typically erupt between ages 11–12, while mandibular canines erupt around 9–10 years. They are among the last anterior teeth to erupt, often following the premolars. Enamel is usually complete by age 7 for mandibular and 6–7 for maxillary canines."
  },
  {
    "title": "Functional Form of Canines",
    "content": "Canines display features of both anterior and posterior teeth. They resemble incisors in their cutting edges and premolars in their bulk and cusp structure. This hybrid form enables them to shear and support occlusal load."
  },
  {
    "title": "Wear Patterns and Occlusal Guidance",
    "content": "Canine guidance is a dynamic occlusal relationship where the canines disclude posterior teeth during lateral movement. Wear occurs primarily on the incisal and cusp ridges, especially on the maxillary canine's distal slope."
  },
  {
    "title": "Variations in Canine Morphology",
    "content": "Uncommon variations include peg-shaped crowns, root dilaceration, and bifid roots. Root curvature is more often distal in maxillary and mesial in mandibular canines. These variations must be considered during endodontic or orthodontic treatment.",
    "reference": "See Fig. 8.24 on p. 127"
  },
  {
    "title": "Summary: Maxillary vs. Mandibular Canines",
    "content": "Maxillary canines are wider mesiodistally, more prominent lingually, and possess longer roots. Mandibular canines are narrower, with less pronounced lingual anatomy and occasional bifurcated roots. Both play vital roles in esthetics, occlusion, and dental arch stability."
  }
]