{
  "default": {
    "patient_info": {
      "name": "Иван Петров",
      "age": 58,
      "gender": "male",
      "image": "patient_default.jpg",
      "medical_history": "Сахарный диабет 2 типа (компенсированный), Гипертоническая болезнь II стадии (контролируемая). Принимает: Метформин 1000 мг/сут, Лизиноприл 10 мг/сут. Аллергии: Нет известных"
    },
    "initial_state": {
      "node_id": "start",
      "patient_statement": "Сильная, пульсирующая боль в зубе слева внизу, особенно ночью. Реагирует на горячее, холодное немного успокаивает. Боль уже 3 дня.",
      "patient_emotion": "concerned",
      "notes": "Пациент с сахарным диабетом и гипертонией. Жалуется на острую пульсирующую боль в зубе 36."
    },
    "dialogue_nodes": [
      {
        "id": "start",
        "patient_statement": "Здравствуйте, Иван Петрович. Расскажите, что вас беспокоит?",
        "options": [
          {
            "text": "Пациент описывает жалобы (см. initial_complaint)",
            "next_node": "history_taking",
            "score": 0
          }
        ]
      },
      {
        "id": "history_taking",
        "patient_statement": "Понятно. Боль сильная, мешает спать. Скажите, у вас есть какие-либо хронические заболевания? Принимаете ли вы постоянно какие-либо лекарства? Есть ли аллергия?",
        "options": [
          {
            "text": "Пациент сообщает о диабете, гипертонии и принимаемых препаратах (Метформин, Лизиноприл). Аллергии нет.",
            "next_node": " уточнение_анамнеза",
            "score": 5
          },
          {
            "text": "Сразу перейти к осмотру, пропустив сбор анамнеза.",
            "next_node": "examination_initial",
            "score": -10
          }
        ]
      },
      {
        "id": "уточнение_анамнеза",
        "patient_statement": "Спасибо за информацию. Диабет компенсирован? Давление контролируете? Показатели сахара и давления в норме в последнее время?",
        "options": [
          {
            "text": "Пациент: 'Да, стараюсь следить. Сахар утром обычно 6-7, давление 130/85 примерно.'",
            "next_node": "examination_initial",
            "score": 5
          }
        ]
      },
      {
        "id": "examination_initial",
        "patient_statement": "Хорошо, давайте посмотрим. Откройте, пожалуйста, рот. [Проводит осмотр, перкуссию, пальпацию]",
        "notes": "Зуб 36: глубокая кариозная полость, реакция на перкуссию резко болезненная. Слизистая в области верхушки корня без видимых изменений.",
        "options": [
          {
            "text": "Перейти к диагностическим тестам (ЭОД, холодовой тест, рентген)",
            "next_node": "diagnostic_tests",
            "score": 0
          }
        ]
      },
      {
        "id": "diagnostic_tests",
        "patient_statement": "Нужно сделать рентгеновский снимок и провести тесты, чтобы точно определить состояние зуба.",
        "options": [
          {
            "text": "Выполнить прицельный рентген зуба 36 и ЭОД.",
            "next_node": "diagnosis",
            "score": 10
          },
          {
            "text": "Предложить лечение без дополнительных тестов, основываясь только на клинике.",
            "next_node": "premature_treatment_offer",
            "score": -15
          }
        ]
      },
      {
        "id": "diagnosis",
        "patient_statement": "По результатам осмотра и снимка у вас диагноз: Хронический апикальный периодонтит зуба 36 в стадии обострения. Нерв в зубе погиб, и началось воспаление у верхушки корня.",
        "options": [
          {
            "text": "Обсудить варианты лечения: эндодонтическое лечение (лечение каналов) или удаление зуба.",
            "next_node": "treatment_options",
            "score": 0
          }
        ]
      },
      {
        "id": "treatment_options",
        "patient_statement": "Есть два варианта: \n1. Попытаться спасти зуб - провести лечение корневых каналов с последующим восстановлением коронкой. Это позволит сохранить зуб, но лечение длительное и более дорогостоящее. \n2. Удалить зуб. Это быстрее и дешевле сейчас, но потом может потребоваться протезирование, чтобы восстановить жевательную функцию. \nУчитывая ваш диабет, процесс заживления при любом вмешательстве может быть немного дольше. Какой вариант вам кажется предпочтительным?",
        "options": [
          {
            "text": "Пациент (встревоженно): 'Доктор, а лечение каналов - это очень больно? И сколько это будет стоить? Я боюсь боли и больших трат. Может, проще удалить?'",
            "next_node": "addressing_fears_cost",
            "score": 0
          },
          {
            "text": "Пациент: 'Давайте лечить каналы, хочу сохранить зуб.'",
            "next_node": "consent_rct",
            "score": 0
          },
          {
            "text": "Пациент: 'Нет, доктор, только удаление. Быстрее и проще.'",
            "next_node": "consent_extraction",
            "score": 0
          }
        ]
      },
      {
        "id": "addressing_fears_cost",
        "patient_statement": "Понимаю ваши опасения. Лечение каналов проводится под адекватной анестезией, боли быть не должно. Мы подберем анестетик с учетом вашей гипертонии. Да, это инвестиция, но сохранение своего зуба обычно предпочтительнее в долгосрочной перспективе. Удаление кажется простым решением сейчас, но отсутствие зуба влияет на жевание и соседние зубы. Давайте обсудим этапы и примерную стоимость лечения каналов.",
        "options": [
          {
            "text": "Пациент (после разъяснений): 'Хорошо, доктор, вы меня убедили. Давайте попробуем спасти зуб. Только сделайте хорошую анестезию!'",
            "next_node": "consent_rct",
            "score": 10
          },
          {
            "text": "Пациент: 'Нет, я все равно не готов к такому лечению. Слишком сложно и дорого. Давайте удалять.'",
            "next_node": "consent_extraction",
            "score": 0
          }
        ]
      },
      {
        "id": "consent_rct",
        "patient_statement": "Отлично. Тогда сейчас проведем анестезию и начнем первый этап лечения каналов. Установим временную пломбу. Потребуется несколько визитов.",
        "options": [
           {
              "text": "Пациент согласен, подписал ИДС. Начать процедуру.",
              "next_node": "rct_stage1",
              "score": 0
           },
           {
              "text": "Пациент вдруг передумал: 'Ой, нет, я не могу, слишком страшно. Давайте все-таки удалим!'",
              "next_node": "consent_extraction",
              "score": -5
           }
        ]
      },
      {
          "id": "rct_stage1",
          "patient_statement": "[Симуляция первого этапа RCT: анестезия (с учетом ГБ), изоляция, вскрытие полости, мех. и мед. обработка каналов, временное пломбирование гидроксидом кальция, временная пломба]. Все прошло хорошо. Назначу вам обезболивающее на всякий случай. Если будет сильная боль или отек - сразу звоните. Следующий визит через неделю.",
          "options": [
              {
                 "text": "Пациент уходит. Запланировать следующий визит.",
                 "next_node": "rct_followup_week1",
                 "score": 0
              }
          ]
      },
       {
           "id": "rct_followup_week1",
           "patient_statement": "[Через неделю] Здравствуйте, доктор. Вроде все нормально было, зуб не беспокоил почти.",
           "patient_emotion": "neutral",
           "options": [
               {
                   "text": "Продолжить лечение: снять временную пломбу, завершить обработку каналов, запломбировать каналы постоянно.",
                   "next_node": "rct_stage2_completion",
                   "score": 15
               }
           ]
       },
       {
           "id": "rct_stage2_completion",
           "patient_statement": "[Симуляция второго этапа RCT: пломбирование каналов гуттаперчей, контрольный рентген, установка постоянной пломбы/подготовка под коронку]. Лечение каналов завершено. Снимок хороший. Теперь зуб нужно будет покрыть коронкой для надежности.",
           "options": [
               {
                   "text": "Запланировать протезирование (коронка). Сценарий успешно завершен (терапевтическая часть).",
                   "next_node": "end_success_rct",
                   "score": 0
               }
           ]
       },
      {
        "id": "consent_extraction",
        "patient_statement": "Хорошо, если вы так решили. Удаление тоже проведем под анестезией. Учитывая вашу гипертонию, важно будет проконтролировать давление перед процедурой и использовать анестетик без адреналина или с минимальным его содержанием. После удаления нужно будет строго соблюдать рекомендации.",
        "options": [
          {
            "text": "Пациент согласен, подписал ИДС на удаление. Проверить АД.",
            "next_node": "extraction_prepare",
            "score": 0
          }
        ]
      },
       {
           "id": "extraction_prepare",
           "patient_statement": "Измерим давление. [Результат: 135/85 мм рт. ст.]. Давление в пределах нормы для вас. Можем приступать.",
           "options": [
                {
                   "text": "Провести анестезию (адаптированную) и удаление зуба 36.",
                   "next_node": "extraction_procedure",
                   "score": 0
                },
                {
                   "text": "[Неверный путь] Использовать стандартный анестетик с адреналином без учета ГБ.",
                   "next_node": "extraction_wrong_anesthesia",
                   "score": -10
                }
           ]
       },
      {
        "id": "extraction_procedure",
        "patient_statement": "[Симуляция удаления зуба 36]. Удаление прошло успешно. Накладываю швы [если необходимо], даю рекомендации: прикусить тампон на 20 минут, не полоскать рот сегодня, не есть горячее, прикладывать холод. Назначу обезболивающее. Из-за диабета заживление может идти чуть дольше, следите за гигиеной.",
        "options": [
          {
            "text": "Пациент получил рекомендации, уходит. Назначить контрольный осмотр через несколько дней.",
            "next_node": "extraction_followup",
            "score": 0
          }
        ]
      },
      {
           "id": "extraction_followup",
           "patient_statement": "[Через 3 дня] Здравствуйте, доктор. Лунка немного ноет, но в целом терпимо. Кровотечения не было.",
           "patient_emotion": "neutral",
           "options": [
               {
                   "text": "Осмотреть лунку. Заживление удовлетворительное. Дать дальнейшие рекомендации.",
                   "next_node": "end_success_extraction",
                   "score": 10
               }
           ]
       },
      {
        "id": "premature_treatment_offer",
        "patient_statement": "Думаю, здесь можно поставить большую пломбу, предварительно удалив нерв. Давайте начнем?",
        "options": [
           {
              "text": "Пациент соглашается.",
              "next_node": "incorrect_treatment_filling",
              "score": 0
           }
        ]
      },
      {
          "id": "incorrect_treatment_filling",
          "patient_statement": "[Симуляция попытки лечения как пульпита или установки пломбы без адекватной диагностики]. Готово. Если будет беспокоить - приходите.",
          "options": [
              {
                 "text": "Пациент уходит.",
                 "next_node": "incorrect_treatment_return",
                 "score": 0
              }
          ]
      },
      {
          "id": "incorrect_treatment_return",
          "patient_statement": "[Через 5 дней] Доктор! У меня щеку раздуло, боль адская, температура! Вы что-то не то сделали!",
          "patient_emotion": "angry",
          "options": [
               {
                  "text": "Признать ошибку в первичной диагностике, провести рентген и тесты СЕЙЧАС, поставить верный диагноз (периодонтит), объяснить ситуацию пациенту и предложить адекватное лечение (RCT или удаление).",
                  "next_node": "diagnosis",
                  "score": -20
              }
          ]
      },
       {
          "id": "extraction_wrong_anesthesia",
          "patient_statement": "[Во время или сразу после анестезии] Доктор, у меня сердце заколотилось, руки трясутся, голова закружилась!",
          "patient_emotion": "anxious",
          "notes": "Пациент бледный, тахикардия, возможно повышение АД.",
          "options": [
               {
                   "text": "Прекратить процедуру, успокоить пациента, контролировать АД и пульс, дать гипотензивное (если нужно и возможно), отложить вмешательство до стабилизации состояния. В дальнейшем использовать анестетик без вазоконстриктора.",
                   "next_node": "manage_anesthesia_complication",
                   "score": 5
               }
          ]
      },
       {
           "id": "manage_anesthesia_complication",
           "patient_statement": "Спокойно, Иван Петрович, сейчас все пройдет. Это реакция на анестетик. Давайте отложим удаление на сегодня, пока состояние не стабилизируется. В следующий раз подберем другой препарат.",
           "options": [
               {
                  "text": "Пациент согласен. Перенести визит.",
                  "next_node": "end_complication_anesthesia",
                  "score": 0
               }
           ]
       }
    ],
    "outcomes": {
        "correct_diagnosis_rct": {
            "text": "Отлично! Вы правильно диагностировали хронический апикальный периодонтит, учли сопутствующие заболевания пациента, успешно провели эндодонтическое лечение и сохранили зуб.",
            "min_score": 80,
            "badge": "conservative_dentistry_1"
        },
        "correct_diagnosis_extraction": {
            "text": "Вы верно поставили диагноз и провели удаление с учетом сопутствующих заболеваний. Однако, сохранение зуба было бы предпочтительнее.",
            "min_score": 50,
             "badge": "surgical_skills_1"
        },
        "partial_management": {
             "text": "Вы столкнулись с трудностями (осложнение анестезии / несвоевременная диагностика), но смогли скорректировать план лечения. Будьте внимательнее к анамнезу и диагностике.",
             "min_score": 20,
             "badge": null
        },
        "incorrect_management": {
            "text": "Вы не смогли правильно диагностировать заболевание и/или не учли сопутствующие заболевания/осложнения, что привело к ухудшению состояния пациента.",
            "min_score": 0,
            "badge": null
       }
    }
  }
}