{
    "title": {
      "en": "Severe Toothache Case",
      "ru": "Случай сильной зубной боли",
      "nl": "Casus Ernstige Kiespijn"
    },
    "description": {
      "en": "A virtual patient, Jan De Wit, presents with acute toothache, and the dentist needs to conduct an interview, suggest necessary investigations (X-ray), and establish a diagnosis of irreversible pulpitis.",
      "ru": "Виртуальный пациент, Ян Де Вит, обращается с острой зубной болью. Врач должен провести опрос, предложить необходимые обследования (рентген) и поставить диагноз \"необратимый пульпит\".",
      "nl": "Een virtuele patiënt, Jan De Wit, presenteert zich met acute kiespijn. De tandarts moet een anamnese afnemen, noodzakelijk onderzoek voorstellen (röntgenfoto) en de diagnose irreversibele pulpitis stellen."
    },
    "scenario_data": {
      "translations": {
        "en": {
          "patient_info": {
            "name": "Jan De Wit",
            "age": "45 years old",
            "chief_complaint": "Severe toothache",
            "medical_history": "Generally healthy, no known allergies to medications. Does not take any regular medications."
          },
          "initial_state": {
            "patient_statement": "Hello doctor. I have a terrible toothache.",
            "notes": "Patient Jan De Wit, 45, presents with acute pain. Information on screen: Jan De Wit, 45 years old, presented with acute pain."
          },
          "dialogue_nodes": [
            {
              "id": "node_start",
              "title": "Initial questioning",
              "options": [
                {
                  "text": "Hello Jan. Please tell me more about your pain. Where exactly does it hurt?",
                  "next_node": "node_location_onset_response",
                  "score": 10,
                  "feedback": "Good open-ended question focusing on location and inviting the patient to elaborate."
                },
                {
                  "text": "Good day. How long have you had this toothache?",
                  "next_node": "node_duration_first_response",
                  "score": 7,
                  "feedback": "A relevant question, but starting with location and general description can sometimes be more helpful to narrow down."
                },
                {
                  "text": "Hello. Besides the pain, do you have any other complaints?",
                  "next_node": "node_other_complaints_first_response",
                  "score": 6,
                  "feedback": "It's good to ask about other symptoms, but understanding the primary complaint (pain) in detail first is usually prioritized."
                }
              ]
            },
            {
              "id": "node_location_onset_response",
              "title": "Patient describes location and onset",
              "patient_statement": "It hurts here (points to the lower jaw on the right, in the molar area). The pain started about three days ago, but today it has become unbearable.",
              "options": [
                {
                  "text": "I understand. Can you pinpoint the exact tooth that hurts, or is the pain more diffuse? Also, how would you describe the nature of the pain – is it sharp, dull, throbbing? Is the pain constant or does it come in waves?",
                  "next_node": "node_detailed_pain_description_response",
                  "score": 10,
                  "feedback": "Excellent comprehensive question covering localization, character, and pattern of pain."
                },
                {
                  "text": "Can you show me the exact tooth?",
                  "next_node": "node_specify_tooth_response_only",
                  "score": 7,
                  "feedback": "Good for localization, but more details about the pain itself are needed."
                },
                {
                  "text": "What kind of pain is it? Sharp, dull, throbbing?",
                  "next_node": "node_pain_character_response_only",
                  "score": 7,
                  "feedback": "Important detail, but combine with localization and pattern for efficiency."
                }
              ]
            },
            {
              "id": "node_duration_first_response",
              "title": "Patient responds about duration",
              "patient_statement": "The pain started about three days ago, but today it's much worse.",
              "options": [
                {
                  "text": "Okay. And where exactly is the pain located? Can you point to the tooth?",
                  "next_node": "node_location_onset_response",
                  "score": 8
                }
              ]
            },
            {
              "id": "node_other_complaints_first_response",
              "title": "Patient responds about other complaints",
              "patient_statement": "No, mainly this terrible pain. It's unbearable.",
              "options": [
                {
                  "text": "I see. Let's focus on the pain then. Where exactly does it hurt and how long has it been?",
                  "next_node": "node_location_onset_response",
                  "score": 8
                }
              ]
            },
            {
              "id": "node_specify_tooth_response_only",
              "title": "Patient specifies tooth",
              "patient_statement": "It seems to be this back one (points to the first or second molar on the lower right).",
              "options": [
                {
                  "text": "And how would you describe the nature of the pain – is it sharp, dull, throbbing? Is the pain constant or does it come in waves?",
                  "next_node": "node_detailed_pain_description_response_partial",
                  "score": 9
                }
              ]
            },
            {
              "id": "node_pain_character_response_only",
              "title": "Patient describes pain character",
              "patient_statement": "It's a very strong pain, I'd say throbbing, pulsating.",
              "options": [
                {
                  "text": "Can you pinpoint the exact tooth? Is the pain constant or intermittent?",
                  "next_node": "node_detailed_pain_description_response_partial2",
                  "score": 9
                }
              ]
            },
            {
              "id": "node_detailed_pain_description_response",
              "title": "Patient gives detailed pain description",
              "patient_statement": "At first, it wasn't clear which one exactly, but now it seems to be this back one (points to the first or second molar on the lower right). The pain is very strong, I'd say throbbing, pulsating. Yesterday it would subside for a short while and then start again, but today it's been hurting almost constantly.",
              "options": [
                {
                  "text": "Understood. Are there any factors that worsen the pain? For example, any reaction to hot or cold? Does the pain intensify when you lie down or at night? Please rate the pain intensity on a scale from 0 (no pain) to 10 (unbearable pain).",
                  "next_node": "node_aggravating_factors_intensity_response",
                  "score": 10,
                  "feedback": "Key questions for diagnosing pulpitis, covering triggers, nocturnal pain, and intensity."
                }
              ]
            },
            {
              "id": "node_detailed_pain_description_response_partial",
              "patient_statement": "It's a very strong pain, I'd say throbbing, pulsating. Yesterday it would subside for a short while and then start again, but today it's been hurting almost constantly.",
               "options": [
                {
                  "text": "Understood. Are there any factors that worsen the pain? For example, any reaction to hot or cold? Does the pain intensify when you lie down or at night? Please rate the pain intensity on a scale from 0 (no pain) to 10 (unbearable pain).",
                  "next_node": "node_aggravating_factors_intensity_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_detailed_pain_description_response_partial2",
              "patient_statement": "At first, it wasn't clear which one exactly, but now it seems to be this back one (points to the first or second molar on the lower right). Today it's been hurting almost constantly.",
               "options": [
                {
                  "text": "Understood. Are there any factors that worsen the pain? For example, any reaction to hot or cold? Does the pain intensify when you lie down or at night? Please rate the pain intensity on a scale from 0 (no pain) to 10 (unbearable pain).",
                  "next_node": "node_aggravating_factors_intensity_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_aggravating_factors_intensity_response",
              "title": "Patient describes aggravating factors and intensity",
              "patient_statement": "Yes, hot tea makes it sharply worse, the pain shoots and then doesn't let go for a long time. With cold, at first, it seems a tiny bit better for a second, but then it also starts to hurt a lot. I hardly slept last night; the pain was especially severe when I was lying down. Right now, the pain is about an 8-9 out of 10.",
              "options": [
                {
                  "text": "Have you taken any painkillers? If so, which ones, and did they have any effect?",
                  "next_node": "node_painkiller_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_painkiller_response",
              "title": "Patient describes painkiller use",
              "patient_statement": "Yes, I took paracetamol, then ibuprofen. At first, it seemed to help a little, but today they hardly work; the pain returns quickly.",
              "options": [
                {
                  "text": "Have you had similar pain before in this tooth or other teeth? Have there been any injuries to this tooth or treatment in the past? Do you have any general medical conditions I should be aware of, or do you take any medications regularly?",
                  "next_node": "node_history_general_health_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_history_general_health_response",
              "title": "Patient provides history and general health information",
              "patient_statement": "No, I haven't had such severe pain before. This tooth was treated a long time ago, about 5 years ago, they put in a filling. There were no injuries. Regarding chronic diseases – nothing serious, no drug allergies. I don't take anything regularly.",
              "options": [
                {
                  "text": "Jan, based on your complaints, I need to conduct a clinical examination of your oral cavity, check the tooth's reaction to temperature stimuli and percussion (tapping). Also, to clarify the diagnosis and assess the condition of the tooth and its surrounding tissues, we absolutely need to take an X-ray of this tooth. This will help us see how deep the inflammation has spread and the condition of the tooth roots. Do you agree?",
                  "next_node": "node_patient_agrees_to_xray",
                  "score": 10,
                  "feedback": "Crucial step: proposing necessary diagnostic procedures including an X-ray, and explaining the rationale."
                }
              ]
            },
            {
              "id": "node_patient_agrees_to_xray",
              "title": "Patient agrees to examination and X-ray",
              "patient_statement": "Yes, doctor, of course, do whatever is necessary, just make this pain go away.",
              "options": [
                {
                  "text": "(Proceed to simulate clinical examination and X-ray interpretation, then deliver diagnosis)",
                  "next_node": "outcome_irreversible_pulpitis_diagnosed",
                  "score": 10
                }
              ]
            }
          ],
          "outcomes": {
            "outcome_irreversible_pulpitis_diagnosed": {
              "title": "Diagnosis: Irreversible Pulpitis",
              "text": "Jan, I have completed the examination and reviewed the X-ray. The clinical picture and radiographic data confirm my suspicions. You have irreversible pulpitis – this is an acute inflammation of the tooth's pulp ('nerve'), which unfortunately cannot resolve on its own. The cause is most likely a deep carious lesion (or a defect under an old filling) through which infection has entered the pulp. The most effective treatment, in this case, will be endodontic treatment, i.e., root canal treatment. This will allow us to remove the inflamed pulp, eliminate the infection, and save the tooth. We will discuss all the details of this treatment. The main thing is that we can relieve your pain.\n\nFeedback: You successfully gathered a thorough history, including pain localization, character, onset, duration, provoking/relieving factors, intensity, and previous dental/medical history. Your suggestion for an X-ray was timely and well-justified. The diagnosis of irreversible pulpitis is consistent with the presented symptoms. This approach aligns with the requirements for BI-toets, emphasizing systematic anamnesis and appropriate diagnostic planning."
            },
            "outcome_needs_more_info": {
              "title": "Further Information Required",
              "text": "While you've started the interview, more specific questions about the pain's nature (e.g., throbbing, sharp), exact triggers (hot, cold, biting), duration of pain after a trigger, and nocturnal symptoms are needed to form a clearer preliminary diagnosis before suggesting further tests."
            }
          }
        },
        "ru": {
          "patient_info": {
            "name": "Ян Де Вит",
            "age": "45 лет",
            "chief_complaint": "Сильная зубная боль",
            "medical_history": "В целом здоров, аллергии на лекарства нет. Постоянно ничего не принимает."
          },
          "initial_state": {
            "patient_statement": "Здравствуйте, доктор. У меня ужасно болит зуб.",
            "notes": "Пациент Ян Де Вит, 45 лет, обратился с острой болью. Информация на экране: Ян Де Вит, 45 лет, обратился с острой болью."
          },
          "dialogue_nodes": [
            {
              "id": "node_start",
              "title": "Первичный опрос",
              "options": [
                {
                  "text": "Здравствуйте, Ян. Расскажите, пожалуйста, подробнее о вашей боли. Где именно болит?",
                  "next_node": "node_location_onset_response",
                  "score": 10,
                  "feedback": "Хороший открытый вопрос, сфокусированный на локализации и приглашающий пациента рассказать подробнее."
                },
                {
                  "text": "Добрый день. Как давно у вас болит зуб?",
                  "next_node": "node_duration_first_response",
                  "score": 7,
                  "feedback": "Уместный вопрос, но начало с локализации и общего описания иногда бывает более полезным для сужения поиска."
                },
                {
                  "text": "Здравствуйте. Кроме боли, есть ли какие-то еще жалобы?",
                  "next_node": "node_other_complaints_first_response",
                  "score": 6,
                  "feedback": "Хорошо спросить о других симптомах, но обычно сначала приоритет отдается детальному пониманию основной жалобы (боли)."
                }
              ]
            },
            {
              "id": "node_location_onset_response",
              "title": "Пациент описывает локализацию и начало боли",
              "patient_statement": "Болит здесь (указывает на нижнюю челюсть справа, в области моляров). Боль началась дня три назад, но сегодня стало совсем невыносимо.",
              "options": [
                {
                  "text": "Понимаю. Можете ли вы точно указать, какой именно зуб болит, или боль скорее разлитая? И как бы Вы описали характер боли – она острая, тупая, пульсирующая? Боль постоянная или возникает приступами?",
                  "next_node": "node_detailed_pain_description_response",
                  "score": 10,
                  "feedback": "Отличный всеобъемлющий вопрос, охватывающий локализацию, характер и тип боли."
                },
                {
                  "text": "Можете показать точный зуб?",
                  "next_node": "node_specify_tooth_response_only",
                  "score": 7,
                  "feedback": "Хорошо для локализации, но нужны дополнительные детали о самой боли."
                },
                {
                  "text": "Какая это боль? Острая, тупая, пульсирующая?",
                  "next_node": "node_pain_character_response_only",
                  "score": 7,
                  "feedback": "Важная деталь, но для эффективности объедините с локализацией и характером течения."
                }
              ]
            },
            {
              "id": "node_duration_first_response",
              "title": "Пациент отвечает о продолжительности",
              "patient_statement": "Боль началась дня три назад, но сегодня намного хуже.",
              "options": [
                {
                  "text": "Хорошо. А где именно болит? Можете указать зуб?",
                  "next_node": "node_location_onset_response",
                  "score": 8
                }
              ]
            },
            {
              "id": "node_other_complaints_first_response",
              "title": "Пациент отвечает о других жалобах",
              "patient_statement": "Нет, в основном эта ужасная боль. Она невыносима.",
              "options": [
                {
                  "text": "Понятно. Давайте тогда сосредоточимся на боли. Где именно болит и как давно?",
                  "next_node": "node_location_onset_response",
                  "score": 8
                }
              ]
            },
            {
              "id": "node_specify_tooth_response_only",
              "title": "Пациент указывает зуб",
              "patient_statement": "Кажется, вот этот задний (указывает на первый или второй моляр нижней челюсти справа).",
              "options": [
                {
                  "text": "А как бы Вы описали характер боли – она острая, тупая, пульсирующая? Боль постоянная или возникает приступами?",
                  "next_node": "node_detailed_pain_description_response_partial",
                  "score": 9
                }
              ]
            },
            {
              "id": "node_pain_character_response_only",
              "title": "Пациент описывает характер боли",
              "patient_statement": "Боль очень сильная, я бы сказал, пульсирующая, дергающая.",
              "options": [
                {
                  "text": "Можете ли вы точно указать, какой именно зуб болит? Боль постоянная или возникает приступами?",
                  "next_node": "node_detailed_pain_description_response_partial2",
                  "score": 9
                }
              ]
            },
            {
              "id": "node_detailed_pain_description_response",
              "title": "Пациент подробно описывает боль",
              "patient_statement": "Сначала было непонятно, какой именно, но сейчас кажется, что вот этот, задний (указывает на первый или второй моляр нижней челюсти справа). Боль очень сильная, я бы сказал, пульсирующая, дергающая. Вчера она то утихала ненадолго, то снова начиналась, а сегодня почти постоянно болит.",
              "options": [
                {
                  "text": "Понятно. Скажите, пожалуйста, есть ли какие-то факторы, которые усиливают боль? Например, реакция на горячее или холодное? Усиливается ли боль в положении лежа или ночью? Оцените интенсивность боли по шкале от 0 (нет боли) до 10 (невыносимая боль).",
                  "next_node": "node_aggravating_factors_intensity_response",
                  "score": 10,
                  "feedback": "Ключевые вопросы для диагностики пульпита, охватывающие провоцирующие факторы, ночную боль и интенсивность."
                }
              ]
            },
            {
              "id": "node_detailed_pain_description_response_partial",
              "patient_statement": "Боль очень сильная, я бы сказал, пульсирующая, дергающая. Вчера она то утихала ненадолго, то снова начиналась, а сегодня почти постоянно болит.",
               "options": [
                {
                  "text": "Понятно. Скажите, пожалуйста, есть ли какие-то факторы, которые усиливают боль? Например, реакция на горячее или холодное? Усиливается ли боль в положении лежа или ночью? Оцените интенсивность боли по шкале от 0 (нет боли) до 10 (невыносимая боль).",
                  "next_node": "node_aggravating_factors_intensity_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_detailed_pain_description_response_partial2",
              "patient_statement": "Сначала было непонятно, какой именно, но сейчас кажется, что вот этот, задний (указывает на первый или второй моляр нижней челюсти справа). Сегодня почти постоянно болит.",
               "options": [
                {
                  "text": "Понятно. Скажите, пожалуйста, есть ли какие-то факторы, которые усиливают боль? Например, реакция на горячее или холодное? Усиливается ли боль в положении лежа или ночью? Оцените интенсивность боли по шкале от 0 (нет боли) до 10 (невыносимая боль).",
                  "next_node": "node_aggravating_factors_intensity_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_aggravating_factors_intensity_response",
              "title": "Пациент описывает провоцирующие факторы и интенсивность",
              "patient_statement": "Да, от горячего чая становится резко хуже, боль прямо простреливает и потом долго не отпускает. От холодного сначала вроде чуть легче на секунду, а потом тоже начинает сильно болеть. Ночью сегодня почти не спал, боль была особенно сильной, когда лежал. Сейчас боль где-то на 8-9 из 10.",
              "options": [
                {
                  "text": "Принимали ли вы какие-нибудь обезболивающие? Если да, то какие и был ли от них эффект?",
                  "next_node": "node_painkiller_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_painkiller_response",
              "title": "Пациент описывает прием обезболивающих",
              "patient_statement": "Да, пил парацетамол, потом ибупрофен. Сначала вроде немного помогало, но сегодня уже почти не действуют, боль быстро возвращается.",
              "options": [
                {
                  "text": "Были ли у вас подобные боли раньше в этом зубе или в других зубах? Были ли какие-то травмы этого зуба или лечение в прошлом? Есть ли у Вас общие заболевания, о которых мне следует знать, или принимаете ли Вы какие-либо лекарства на постоянной основе?",
                  "next_node": "node_history_general_health_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_history_general_health_response",
              "title": "Пациент предоставляет анамнез и общую информацию о здоровье",
              "patient_statement": "Нет, такой сильной боли раньше не было. Этот зуб лечили давно, лет 5 назад, ставили пломбу. Травм не было. Из хронических заболеваний – ничего серьезного, аллергии на лекарства нет. Постоянно ничего не принимаю.",
              "options": [
                {
                  "text": "Ян, на основании ваших жалоб, мне необходимо провести клинический осмотр полости рта, проверить реакцию зуба на температурные раздражители и перкуссию (постукивание). Также, для уточнения диагноза и оценки состояния зуба и окружающих его тканей, нам обязательно нужно будет сделать рентгеновский снимок этого зуба. Это поможет нам увидеть, насколько глубоко распространилось воспаление и каково состояние корней зуба. Вы согласны?",
                  "next_node": "node_patient_agrees_to_xray",
                  "score": 10,
                  "feedback": "Ключевой шаг: предложение необходимых диагностических процедур, включая рентген, и объяснение их целесообразности."
                }
              ]
            },
            {
              "id": "node_patient_agrees_to_xray",
              "title": "Пациент соглашается на осмотр и рентген",
              "patient_statement": "Да, доктор, конечно, делайте все, что нужно, лишь бы эта боль прошла.",
              "options": [
                {
                  "text": "(Перейти к симуляции клинического осмотра и интерпретации рентгеновского снимка, затем постановка диагноза)",
                  "next_node": "outcome_irreversible_pulpitis_diagnosed",
                  "score": 10
                }
              ]
            }
          ],
          "outcomes": {
            "outcome_irreversible_pulpitis_diagnosed": {
              "title": "Диагноз: Необратимый пульпит",
              "text": "Ян, я провел осмотр и изучил рентгеновский снимок. Клиническая картина и данные рентгенографии подтверждают мои предположения. У вас необратимый пульпит – это острое воспаление пульпы зуба («нерва»), которое, к сожалению, уже не может пройти самостоятельно. Причиной, вероятнее всего, стала глубокая кариозная полость (или дефект под старой пломбой), через которую инфекция проникла в пульпу. Наиболее эффективным лечением в данном случае будет эндодонтическое лечение, то есть лечение корневых каналов. Это позволит убрать воспаленную пульпу, устранить инфекцию и сохранить зуб. Мы обсудим с вами все детали этого лечения. Главное, что мы можем избавить вас от боли.\n\nОбратная связь: Вы успешно собрали подробный анамнез, включая локализацию боли, характер, начало, продолжительность, провоцирующие/облегчающие факторы, интенсивность и предыдущий стоматологический/медицинский анамнез. Ваше предложение сделать рентген было своевременным и хорошо обоснованным. Диагноз необратимого пульпита соответствует представленным симптомам. Такой подход соответствует требованиям BI-toets, подчеркивая систематический сбор анамнеза и соответствующее диагностическое планирование."
            },
            "outcome_needs_more_info": {
              "title": "Требуется дополнительная информация",
              "text": "Хотя вы начали опрос, для формирования более четкого предварительного диагноза перед предложением дальнейших исследований необходимы более конкретные вопросы о характере боли (например, пульсирующая, острая), точных провоцирующих факторах (горячее, холодное, накусывание), продолжительности боли после действия раздражителя и ночных симптомах."
            }
          }
        },
        "nl": {
          "patient_info": {
            "name": "Jan De Wit",
            "age": "45 jaar",
            "chief_complaint": "Ernstige kiespijn",
            "medical_history": "Over het algemeen gezond, geen bekende allergieën voor medicijnen. Gebruikt geen medicijnen op regelmatige basis."
          },
          "initial_state": {
            "patient_statement": "Hallo dokter. Ik heb vreselijke kiespijn.",
            "notes": "Patiënt Jan De Wit, 45 jaar, presenteert zich met acute pijn. Informatie op het scherm: Jan De Wit, 45 jaar, presenteerde zich met acute pijn."
          },
          "dialogue_nodes": [
            {
              "id": "node_start",
              "title": "Initiële vraagstelling",
              "options": [
                {
                  "text": "Hallo Jan. Kunt u mij meer vertellen over uw pijn? Waar doet het precies pijn?",
                  "next_node": "node_location_onset_response",
                  "score": 10,
                  "feedback": "Goede open vraag, gericht op locatie en nodigt de patiënt uit om uit te weiden."
                },
                {
                  "text": "Goedendag. Hoe lang heeft u deze kiespijn al?",
                  "next_node": "node_duration_first_response",
                  "score": 7,
                  "feedback": "Een relevante vraag, maar beginnen met locatie en algemene beschrijving kan soms nuttiger zijn om het te specificeren."
                },
                {
                  "text": "Hallo. Heeft u naast de pijn nog andere klachten?",
                  "next_node": "node_other_complaints_first_response",
                  "score": 6,
                  "feedback": "Het is goed om naar andere symptomen te vragen, maar het eerst gedetailleerd begrijpen van de hoofdklacht (pijn) heeft meestal prioriteit."
                }
              ]
            },
            {
              "id": "node_location_onset_response",
              "title": "Patiënt beschrijft locatie en begin van de pijn",
              "patient_statement": "Het doet hier pijn (wijst naar de rechteronderkaak, in het gebied van de molaren). De pijn begon ongeveer drie dagen geleden, maar vandaag is het ondragelijk geworden.",
              "options": [
                {
                  "text": "Ik begrijp het. Kunt u precies aanwijzen welke kies pijn doet, of is de pijn meer verspreid? En hoe zou u de aard van de pijn omschrijven – is het scherp, dof, kloppend? Is de pijn constant of komt het in golven?",
                  "next_node": "node_detailed_pain_description_response",
                  "score": 10,
                  "feedback": "Uitstekende uitgebreide vraag die lokalisatie, aard en patroon van de pijn behandelt."
                },
                {
                  "text": "Kunt u de precieze kies aanwijzen?",
                  "next_node": "node_specify_tooth_response_only",
                  "score": 7,
                  "feedback": "Goed voor lokalisatie, maar meer details over de pijn zelf zijn nodig."
                },
                {
                  "text": "Wat voor soort pijn is het? Scherp, dof, kloppend?",
                  "next_node": "node_pain_character_response_only",
                  "score": 7,
                  "feedback": "Belangrijk detail, maar combineer met lokalisatie en patroon voor efficiëntie."
                }
              ]
            },
            {
              "id": "node_duration_first_response",
              "title": "Patiënt antwoordt over de duur",
              "patient_statement": "De pijn begon ongeveer drie dagen geleden, maar vandaag is het veel erger.",
              "options": [
                {
                  "text": "Oké. En waar precies bevindt de pijn zich? Kunt u de kies aanwijzen?",
                  "next_node": "node_location_onset_response",
                  "score": 8
                }
              ]
            },
            {
              "id": "node_other_complaints_first_response",
              "title": "Patiënt antwoordt over andere klachten",
              "patient_statement": "Nee, voornamelijk deze vreselijke pijn. Het is ondragelijk.",
              "options": [
                {
                  "text": "Ik begrijp het. Laten we ons dan op de pijn concentreren. Waar doet het precies pijn en hoe lang al?",
                  "next_node": "node_location_onset_response",
                  "score": 8
                }
              ]
            },
            {
              "id": "node_specify_tooth_response_only",
              "title": "Patiënt wijst kies aan",
              "patient_statement": "Het lijkt deze achterste te zijn (wijst naar de eerste of tweede molaar rechtsonder).",
              "options": [
                {
                  "text": "En hoe zou u de aard van de pijn omschrijven – is het scherp, dof, kloppend? Is de pijn constant of komt het in golven?",
                  "next_node": "node_detailed_pain_description_response_partial",
                  "score": 9
                }
              ]
            },
            {
              "id": "node_pain_character_response_only",
              "title": "Patiënt beschrijft aard van de pijn",
              "patient_statement": "Het is een zeer stekende pijn, ik zou zeggen kloppend, pulserend.",
              "options": [
                {
                  "text": "Kunt u precies aanwijzen welke kies pijn doet? Is de pijn constant of met tussenpozen?",
                  "next_node": "node_detailed_pain_description_response_partial2",
                  "score": 9
                }
              ]
            },
            {
              "id": "node_detailed_pain_description_response",
              "title": "Patiënt geeft gedetailleerde beschrijving van de pijn",
              "patient_statement": "Eerst was het niet duidelijk welke precies, maar nu lijkt het deze achterste te zijn (wijst naar de eerste of tweede molaar rechtsonder). De pijn is erg stekend, ik zou zeggen kloppend, pulserend. Gisteren nam het soms even af en begon dan weer, maar vandaag doet het bijna constant pijn.",
              "options": [
                {
                  "text": "Begrepen. Zijn er factoren die de pijn verergeren? Bijvoorbeeld een reactie op warm of koud? Verergert de pijn als u ligt of 's nachts? Beoordeel de pijnintensiteit alstublieft op een schaal van 0 (geen pijn) tot 10 (ondraaglijke pijn).",
                  "next_node": "node_aggravating_factors_intensity_response",
                  "score": 10,
                  "feedback": "Kernvragen voor de diagnose van pulpitis, betreffende triggers, nachtelijke pijn en intensiteit."
                }
              ]
            },
            {
              "id": "node_detailed_pain_description_response_partial",
              "patient_statement": "Het is een zeer stekende pijn, ik zou zeggen kloppend, pulserend. Gisteren nam het soms even af en begon dan weer, maar vandaag doet het bijna constant pijn.",
               "options": [
                {
                  "text": "Begrepen. Zijn er factoren die de pijn verergeren? Bijvoorbeeld een reactie op warm of koud? Verergert de pijn als u ligt of 's nachts? Beoordeel de pijnintensiteit alstublieft op een schaal van 0 (geen pijn) tot 10 (ondraaglijke pijn).",
                  "next_node": "node_aggravating_factors_intensity_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_detailed_pain_description_response_partial2",
              "patient_statement": "Eerst was het niet duidelijk welke precies, maar nu lijkt het deze achterste te zijn (wijst naar de eerste of tweede molaar rechtsonder). Vandaag doet het bijna constant pijn.",
               "options": [
                {
                  "text": "Begrepen. Zijn er factoren die de pijn verergeren? Bijvoorbeeld een reactie op warm of koud? Verergert de pijn als u ligt of 's nachts? Beoordeel de pijnintensiteit alstublieft op een schaal van 0 (geen pijn) tot 10 (ondraaglijke pijn).",
                  "next_node": "node_aggravating_factors_intensity_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_aggravating_factors_intensity_response",
              "title": "Patiënt beschrijft verergerende factoren en intensiteit",
              "patient_statement": "Ja, van warme thee wordt het plotseling erger, de pijn schiet erin en laat dan lang niet los. Bij kou lijkt het eerst heel even iets beter, maar dan begint het ook erg pijn te doen. Ik heb vannacht nauwelijks geslapen; de pijn was vooral hevig als ik lag. Op dit moment is de pijn ongeveer een 8-9 op 10.",
              "options": [
                {
                  "text": "Heeft u pijnstillers genomen? Zo ja, welke en hadden ze effect?",
                  "next_node": "node_painkiller_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_painkiller_response",
              "title": "Patiënt beschrijft gebruik van pijnstillers",
              "patient_statement": "Ja, ik heb paracetamol genomen, daarna ibuprofen. Eerst leek het een beetje te helpen, maar vandaag werken ze nauwelijks; de pijn komt snel terug.",
              "options": [
                {
                  "text": "Heeft u eerder soortgelijke pijn gehad aan deze kies of andere kiezen? Zijn er verwondingen aan deze kies geweest of behandelingen in het verleden? Heeft u algemene medische aandoeningen waar ik van op de hoogte moet zijn, of gebruikt u regelmatig medicijnen?",
                  "next_node": "node_history_general_health_response",
                  "score": 10
                }
              ]
            },
            {
              "id": "node_history_general_health_response",
              "title": "Patiënt geeft voorgeschiedenis en algemene gezondheidsinformatie",
              "patient_statement": "Nee, zulke hevige pijn heb ik nog niet eerder gehad. Deze kies is lang geleden behandeld, ongeveer 5 jaar geleden, er is toen een vulling geplaatst. Er zijn geen verwondingen geweest. Wat betreft chronische ziekten – niets ernstigs, geen medicijnallergieën. Ik gebruik niets regelmatig.",
              "options": [
                {
                  "text": "Jan, op basis van uw klachten moet ik een klinisch onderzoek van uw mondholte uitvoeren, de reactie van de kies op temperatuurprikkels en percussie (tikken) controleren. Ook, om de diagnose te verduidelijken en de toestand van de kies en de omliggende weefsels te beoordelen, moeten we absoluut een röntgenfoto van deze kies maken. Dit helpt ons te zien hoe diep de ontsteking zich heeft verspreid en wat de toestand van de wortels van de kies is. Gaat u akkoord?",
                  "next_node": "node_patient_agrees_to_xray",
                  "score": 10,
                  "feedback": "Cruciale stap: het voorstellen van noodzakelijke diagnostische procedures inclusief een röntgenfoto, en het uitleggen van de reden."
                }
              ]
            },
            {
              "id": "node_patient_agrees_to_xray",
              "title": "Patiënt stemt in met onderzoek en röntgenfoto",
              "patient_statement": "Ja, dokter, natuurlijk, doe wat nodig is, als deze pijn maar verdwijnt.",
              "options": [
                {
                  "text": "(Ga verder met simulatie van klinisch onderzoek en interpretatie van röntgenfoto, lever vervolgens diagnose)",
                  "next_node": "outcome_irreversible_pulpitis_diagnosed",
                  "score": 10
                }
              ]
            }
          ],
          "outcomes": {
            "outcome_irreversible_pulpitis_diagnosed": {
              "title": "Diagnose: Irreversibele Pulpitis",
              "text": "Jan, ik heb het onderzoek afgerond en de röntgenfoto bekeken. Het klinische beeld en de radiografische gegevens bevestigen mijn vermoedens. U heeft irreversibele pulpitis – dit is een acute ontsteking van de pulpa ('zenuw') van de kies, die helaas niet vanzelf kan genezen. De oorzaak is hoogstwaarschijnlijk een diepe carieuze laesie (of een defect onder een oude vulling) waardoor een infectie de pulpa is binnengedrongen. De meest effectieve behandeling in dit geval is een endodontische behandeling, oftewel een wortelkanaalbehandeling. Dit stelt ons in staat de ontstoken pulpa te verwijderen, de infectie te elimineren en de kies te behouden. We zullen alle details van deze behandeling met u bespreken. Het belangrijkste is dat we u van uw pijn kunnen verlossen.\n\nFeedback: U heeft met succes een grondige anamnese afgenomen, inclusief pijnlokalisatie, aard, begin, duur, provocerende/verlichtende factoren, intensiteit en eerdere tandheelkundige/medische voorgeschiedenis. Uw voorstel voor een röntgenfoto was tijdig en goed onderbouwd. De diagnose irreversibele pulpitis is consistent met de gepresenteerde symptomen. Deze aanpak sluit aan bij de eisen voor de BI-toets, waarbij de nadruk ligt op systematische anamnese en adequate diagnostische planning."
            },
            "outcome_needs_more_info": {
              "title": "Verdere Informatie Vereist",
              "text": "Hoewel u met het interview bent begonnen, zijn specifiekere vragen over de aard van de pijn (bijv. kloppend, scherp), exacte triggers (warm, koud, bijten), duur van de pijn na een trigger, en nachtelijke symptomen nodig om een duidelijkere voorlopige diagnose te vormen alvorens verdere tests voor te stellen."
            }
          }
        }
      }
    }
  }