[
    {
      "title": "Боль после пломбирования",
      "description": "Клинический случай пациента с болью после недавнего пломбирования зуба",
      "difficulty": "medium",
      "category": "endodontics",
      "max_score": 140,
      "timeframe": 0,
      "is_premium": false,
      "is_published": true,
      "scenario_data": {
        "patient_info": {
          "name": "Лиза Ван дер Меер",
          "age": 35,
          "gender": "female",
          "image": "patient_maria.jpg",
          "medical_history": "Общее здоровье хорошее. Аллергии нет. Системных заболеваний нет. Регулярно посещает стоматолога. 2 недели назад была установлена композитная пломба на зуб 46."
        },
        "initial_state": {
          "patient_statement": "Добрый день, доктор. У меня сильно болит зуб справа внизу, в который две недели назад поставили пломбу. Сначала всё было нормально, но последние три дня боль становится всё сильнее.",
          "patient_emotion": "concerned",
          "notes": "Пациентка Лиза Ван дер Меер, 35 лет. Общее здоровье в норме. Две недели назад проведено пломбирование кариозной полости на зубе 46 (MOD композитная пломба)."
        },
        "dialogue_nodes": [
          {
            "id": "start",
            "patient_statement": "Добрый день, доктор. У меня сильно болит зуб справа внизу, в который две недели назад поставили пломбу. Сначала всё было нормально, но последние три дня боль становится всё сильнее.",
            "patient_emotion": "concerned",
            "options": [
              {
                "id": "opt_1_1",
                "text": "Здравствуйте! Расскажите, пожалуйста, подробнее о вашей боли. Когда она возникает и как долго длится?",
                "next_node": "pain_description",
                "score": 10
              },
              {
                "id": "opt_1_2",
                "text": "Давайте сразу посмотрим, что с этим зубом. Откройте, пожалуйста, рот.",
                "next_node": "premature_examination",
                "score": 3
              },
              {
                "id": "opt_1_3",
                "text": "Возможно, это нормальная реакция после пломбирования. Давайте подождем еще неделю, все должно пройти само.",
                "next_node": "dismissive_approach",
                "score": -5
              }
            ]
          },
          {
            "id": "pain_description",
            "patient_statement": "Боль пульсирующая, иногда возникает спонтанно даже когда я ничего не делаю. Особенно сильно болит ночью, иногда просыпаюсь от боли. Когда пью горячий чай, боль усиливается и может длиться до 10-15 минут. Холодные напитки не вызывают такой сильной реакции.",
            "patient_emotion": "concerned",
            "options": [
              {
                "id": "opt_2_1",
                "text": "Понимаю, это должно быть очень неприятно. А боль продолжается после того, как вы перестаете есть/пить, или сразу проходит?",
                "next_node": "pain_timing",
                "score": 10
              },
              {
                "id": "opt_2_2",
                "text": "Давайте проведем обследование и определим причину боли.",
                "next_node": "examination_start",
                "score": 5
              },
              {
                "id": "opt_2_3",
                "text": "Я выпишу вам обезболивающее, которое должно помочь с этой проблемой.",
                "next_node": "premature_medication",
                "score": -3
              }
            ]
          },
          {
            "id": "pain_timing",
            "patient_statement": "Боль не проходит сразу, может длиться долго даже после того, как я перестаю есть или пить. Иногда даже просто при наклоне головы вниз боль усиливается. Последние две ночи я плохо спала из-за этого, приходилось принимать ибупрофен.",
            "patient_emotion": "concerned",
            "options": [
              {
                "id": "opt_3_1",
                "text": "Спасибо за подробное описание. Это очень ценная информация. Теперь давайте осмотрим зуб и проведем необходимые тесты.",
                "next_node": "examination_start",
                "score": 10
              },
              {
                "id": "opt_3_2",
                "text": "Эти симптомы указывают на воспаление пульпы. Нам нужно провести рентген, чтобы подтвердить диагноз.",
                "next_node": "premature_xray",
                "score": 5
              },
              {
                "id": "opt_3_3",
                "text": "Продолжайте принимать ибупрофен, и если через неделю не станет лучше, приходите снова.",
                "next_node": "inappropriate_advice",
                "score": -10
              }
            ]
          },
          {
            "id": "examination_start",
            "patient_statement": "Хорошо, доктор. Что именно вы будете проверять?",
            "patient_emotion": "neutral",
            "options": [
              {
                "id": "opt_4_1",
                "text": "Сначала я осмотрю полость рта и пломбированный зуб, затем проведу тесты на чувствительность и перкуссию.",
                "next_node": "proper_examination",
                "score": 10
              },
              {
                "id": "opt_4_2",
                "text": "Давайте сразу сделаем рентген, чтобы не тратить время.",
                "next_node": "premature_xray",
                "score": 0
              },
              {
                "id": "opt_4_3",
                "text": "Я быстро проверю пломбу и окклюзию.",
                "next_node": "insufficient_examination",
                "score": 2
              }
            ]
          },
          {
            "id": "proper_examination",
            "patient_statement": "[Пациентка открывает рот для осмотра] При осмотре: зуб 46 с обширной композитной пломбой MOD. Нет видимых дефектов пломбы или вторичного кариеса. При перкуссии пациентка отмечает незначительную болезненность. Температурные тесты показывают усиленную и продолжительную реакцию на тепло. Электроодонтодиагностика показывает сниженный порог возбудимости пульпы.",
            "patient_emotion": "concerned",
            "options": [
              {
                "id": "opt_5_1",
                "text": "Теперь нам нужно сделать рентгеновский снимок, чтобы оценить состояние зуба более детально.",
                "next_node": "xray_decision",
                "score": 10
              },
              {
                "id": "opt_5_2",
                "text": "Исходя из клинической картины, у вас необратимый пульпит, который требует эндодонтического лечения.",
                "next_node": "diagnosis_without_xray",
                "score": 3
              },
              {
                "id": "opt_5_3",
                "text": "Проблема может быть в окклюзии. Давайте скорректируем высоту пломбы.",
                "next_node": "incorrect_treatment_choice",
                "score": -5
              }
            ]
          },
          {
            "id": "xray_decision",
            "patient_statement": "Хорошо, доктор. Если это необходимо, давайте сделаем рентген.",
            "patient_emotion": "neutral",
            "options": [
              {
                "id": "opt_6_1",
                "text": "Объяснить важность рентгена для точной диагностики и получить информированное согласие",
                "next_node": "xray_explained",
                "score": 10
              },
              {
                "id": "opt_6_2",
                "text": "Направить на рентген без объяснений",
                "next_node": "xray_without_explanation",
                "score": 2
              }
            ]
          },
          {
            "id": "xray_explained",
            "patient_statement": "Я понимаю важность рентгена. Спасибо за объяснение.",
            "patient_emotion": "happy",
            "options": [
              {
                "id": "opt_7_1",
                "text": "Провести рентгенографию и проанализировать результаты",
                "next_node": "xray_analysis",
                "score": 10
              }
            ]
          },
          {
            "id": "xray_analysis",
            "patient_statement": "[Рентгеновский снимок зуба 46] На снимке видна глубокая пломба, очень близкая к пульпе зуба. Признаки периапикальных изменений отсутствуют, но заметно небольшое расширение периодонтальной щели. Кариозное поражение находилось очень близко к пульпарной камере.",
            "patient_emotion": "neutral",
            "options": [
              {
                "id": "opt_8_1",
                "text": "На основании клинической картины и рентгенографии, у вас необратимый пульпит, вызванный глубокой пломбой близко к пульпе. Рекомендуется эндодонтическое лечение (лечение корневых каналов).",
                "next_node": "correct_diagnosis",
                "score": 15
              },
              {
                "id": "opt_8_2",
                "text": "Пломба расположена достаточно близко к пульпе, но я не вижу очевидных проблем. Давайте сначала попробуем снизить чувствительность специальными средствами.",
                "next_node": "conservative_approach",
                "score": -5
              },
              {
                "id": "opt_8_3",
                "text": "Возможно, вам поможет прием противовоспалительных препаратов в течение недели. Если не поможет, тогда рассмотрим вариант лечения каналов.",
                "next_node": "delayed_treatment",
                "score": -8
              }
            ]
          },
          {
            "id": "correct_diagnosis",
            "patient_statement": "Эндодонтическое лечение... это лечение каналов, верно? Это звучит серьёзно. Почему это произошло, если мне только недавно поставили пломбу?",
            "patient_emotion": "concerned",
            "options": [
              {
                "id": "opt_9_1",
                "text": "Иногда кариес располагается очень близко к нерву зуба, и даже при качественном лечении пульпа может воспалиться из-за механического или термического воздействия при препарировании. Это не обязательно означает, что предыдущее лечение было некачественным.",
                "next_node": "thorough_explanation",
                "score": 15
              },
              {
                "id": "opt_9_2",
                "text": "Такое иногда случается после пломбирования. К сожалению, теперь нужно лечить каналы.",
                "next_node": "brief_explanation",
                "score": 5
              },
              {
                "id": "opt_9_3",
                "text": "Возможно, предыдущее лечение было проведено неправильно, но сейчас важнее сосредоточиться на решении проблемы.",
                "next_node": "inappropriate_comment",
                "score": -10
              }
            ]
          },
          {
            "id": "thorough_explanation",
            "patient_statement": "Теперь я лучше понимаю ситуацию. Что именно включает в себя лечение корневых каналов и насколько это болезненно?",
            "patient_emotion": "neutral",
            "options": [
              {
                "id": "opt_10_1",
                "text": "Эндодонтическое лечение включает удаление воспаленной пульпы, очистку и пломбирование корневых каналов. Процедура проводится под местной анестезией, поэтому вы не должны испытывать боли. После лечения может быть некоторый дискомфорт, но он обычно проходит через 1-2 дня. По окончании лечения зуб будет нуждаться в постоянной реставрации.",
                "next_node": "comprehensive_treatment_plan",
                "score": 15
              },
              {
                "id": "opt_10_2",
                "text": "Мы используем современные методы лечения, поэтому процедура практически безболезненна. Не беспокойтесь.",
                "next_node": "simplified_explanation",
                "score": 5
              },
              {
                "id": "opt_10_3",
                "text": "Мы можем начать лечение прямо сейчас, если у вас есть время.",
                "next_node": "rushed_approach",
                "score": 0
              }
            ]
          },
          {
            "id": "comprehensive_treatment_plan",
            "patient_statement": "Спасибо за такое подробное объяснение. Когда мы можем начать лечение и сколько приемов потребуется?",
            "patient_emotion": "happy",
            "options": [
              {
                "id": "opt_11_1",
                "text": "Лечение обычно требует 1-2 посещения, в зависимости от сложности случая. Мы можем начать сегодня, если у вас есть время, или запланировать на ближайшие дни. После завершения эндодонтического лечения, примерно через неделю, нам нужно будет установить постоянную реставрацию для защиты зуба от перелома.",
                "next_node": "final_agreement",
                "score": 15
              },
              {
                "id": "opt_11_2",
                "text": "Это займет 1-2 посещения. Можем записать вас на следующую неделю.",
                "next_node": "delayed_scheduling",
                "score": 5
              }
            ]
          },
          {
            "id": "final_agreement",
            "patient_statement": "Я предпочла бы начать как можно скорее, так как боль очень беспокоит. У меня есть время сегодня, если возможно.",
            "patient_emotion": "happy",
            "options": [
              {
                "id": "opt_12_1",
                "text": "Хорошо, я понимаю ваше беспокойство. Давайте начнем лечение сегодня. Сначала я проведу анестезию, чтобы вы не чувствовали боли, затем изолирую зуб и начну процедуру. Если возникнут вопросы в процессе лечения, не стесняйтесь спрашивать.",
                "next_node": "successful_outcome",
                "score": 10,
                "is_final": true
              }
            ]
          },
          {
            "id": "successful_outcome",
            "is_final": true,
            "patient_statement": "Я рада, что мы решили начать лечение. Надеюсь, после этого боль пройдет.",
            "patient_emotion": "happy"
          }
        ],
        "outcomes": {
          "good": {
            "title": "Отличная диагностика и лечение",
            "text": "Вы правильно диагностировали необратимый пульпит на основе клинического обследования и рентгенографии. Ваш подход к коммуникации был профессиональным и эмпатичным. Пациентка получила полную информацию о диагнозе и вариантах лечения, что позволило ей принять информированное решение.",
            "min_score": 70
          },
          "average": {
            "title": "Адекватная диагностика с некоторыми недочетами",
            "text": "Вы правильно определили основную проблему, но были некоторые недостатки в коммуникации или диагностическом процессе. Для улучшения рекомендуется уделять больше внимания систематическому сбору анамнеза и объяснению пациенту всех аспектов лечения.",
            "min_score": 40
          },
          "poor": {
            "title": "Недостаточная диагностика и лечение",
            "text": "Ваш подход к диагностике не был достаточно систематичным, что привело к неоптимальному плану лечения. Важно проводить полное клиническое обследование, включая соответствующие тесты, и объяснять пациенту диагноз и варианты лечения в понятной форме.",
            "min_score": 0
          }
        }
      }
    }
  ]